{
  "animals": [
    {
      "id": "1",
      "likes": 805,
      "name": "African Elephant",
      "scientific_name": "Loxodonta africana",
      "category": "mammal",
      "description": "The African elephant is the largest land animal on Earth, known for its intelligence, complex social structures, and strong family bonds. They are characterized by their large ears, which help regulate their body temperature, and long trunks that are used for a variety of tasks like feeding, drinking, and communication.",
      "habitat": "Savannas, forests, and grasslands.",
      "diet": "Herbivore - primarily feeds on grasses, leaves, fruits, and bark.",
      "fun_facts": [
        "Elephants can communicate with each other using infrasound, which is inaudible to humans.",
        "They have excellent memories and can recognize individuals even after many years.",
        "African elephants are known to create tools, such as using branches to swat away flies."
      ],
      "population": "Estimated 415,000 in the wild.",
      "image_url": "https://tsavotrust.org/wp-content/uploads/2021/07/MALE-ELEPHANT-KM-RESIZE-e1643371005936.jpg"
    },
    {
      "id": "2",
      "likes": 1070,
      "name": "Bald Eagle",
      "scientific_name": "Haliaeetus leucocephalus",
      "category": "bird",
      "description": "The Bald Eagle is a powerful bird of prey and the national symbol of the United States. Known for its striking white head and tail contrasting with a dark brown body, it represents strength and freedom. Bald Eagles are skilled hunters and have incredible vision, allowing them to spot prey from great distances.",
      "habitat": "Near large bodies of open water with abundant food supply, including lakes, rivers, and coastal regions.",
      "diet": "Carnivore - feeds mainly on fish but will also eat birds, small mammals, and carrion.",
      "fun_facts": [
        "Bald eagles can fly up to 100 mph when diving for prey.",
        "They build massive nests, some weighing up to 2,000 pounds, and can reuse nests for many years.",
        "Adult Bald Eagles can live to be 20-30 years old in the wild."
      ],
      "population": "Over 300,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1769528218/photo/bald-eagle-diving.webp?a=1&b=1&s=612x612&w=0&k=20&c=DrrI7tMDSB27apSfnf3Yp3Jk_ec-gnu-i1DBmt5BH30="
    },
    {
      "id": "3",
      "likes": 2106,
      "name": "Tiger",
      "scientific_name": "Panthera tigris",
      "category": "mammal",
      "description": "The tiger is the largest species of the cat family and is known for its beautiful orange coat marked with black stripes. Each tiger has a unique pattern of stripes. Tigers are solitary animals and are skilled hunters, primarily hunting at night. Their keen senses and powerful bodies make them one of the most formidable predators in their habitat.",
      "habitat": "Forests, mangroves, and grasslands.",
      "diet": "Carnivore - primarily feeds on deer, wild boar, and other wildlife.",
      "fun_facts": [
        "Tigers can leap up to 15 feet in a single jump.",
        "They are strong swimmers and often play in water.",
        "Tigers can be found in various natural habitats across Asia."
      ],
      "population": "Estimated 3,900 in the wild.",
      "image_url": "https://media.istockphoto.com/id/949472768/photo/tiger-portrait.webp?a=1&b=1&s=612x612&w=0&k=20&c=_2getKk8HZ22sg-kVly1dtSHr7EYf66_MR9Xb65iFDA="
    },
    {
      "id": "4",
      "likes": 1070,
      "name": "Cheetah",
      "scientific_name": "Acinonyx jubatus",
      "category": "mammal",
      "description": "The cheetah is the fastest land animal, capable of reaching speeds up to 75 mph in short bursts covering distances up to 500 meters. They are characterized by their thin, lightweight frame, black tear stripes on their faces, and distinctive spotted coats. Cheetahs depend on their speed to catch prey and often hunt solo or in small groups.",
      "habitat": "Savannas and open grasslands.",
      "diet": "Carnivore - primarily preys on small to medium-sized ungulates such as gazelles.",
      "fun_facts": [
        "Unlike other big cats, cheetahs cannot roar; they make a range of vocalizations including chirps and purrs.",
        "They can accelerate from 0 to 60 mph in just three seconds.",
        "Cheetahs have a unique adaptation in their respiratory system allowing for more oxygen during speed runs."
      ],
      "population": "Estimated 7,100 in the wild.",
      "image_url": "https://media.istockphoto.com/id/167768212/photo/cheetah-family.webp?a=1&b=1&s=612x612&w=0&k=20&c=rWWwN4T_ctmHaRNuJt1BXedwuLbweI7JuC1tVuAxBXU="
    },
    {
      "id": "5",
      "likes": 711,
      "name": "Leopard",
      "scientific_name": "Panthera pardus",
      "category": "mammal",
      "description": "Leopards are known for their adaptable nature and are found in a variety of habitats. They have a distinctive golden coat covered in black rosettes and a strong, muscular build. Leopards are solitary animals and are excellent climbers, often hoisting their prey into trees to keep them safe from scavengers.",
      "habitat": "Forests, grasslands, and mountains.",
      "diet": "Carnivore - primarily feeds on medium-sized ungulates, monkeys, and birds.",
      "fun_facts": [
        "Leopards are nocturnal and primarily hunt at night.",
        "They have a powerful bite that allows them to crush the skulls of their prey.",
        "Leopards can run short distances at speeds up to 36 mph."
      ],
      "population": "Estimated 250,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/2140507707/photo/leopard-lies-on-branch-looking-for-prey.webp?a=1&b=1&s=612x612&w=0&k=20&c=3S9gIg33_BVWdoBk7OahS8eqGfg_zvmsKIWP-WLZRos="
    },
    {
      "id": "6",
      "likes": 1201,
      "name": "Giraffe",
      "scientific_name": "Giraffa camelopardalis",
      "category": "mammal",
      "description": "Giraffes are the tallest land animals, easily recognized by their long necks and legs. They have a unique pattern of patches on their coat that provides camouflage in the savanna. Giraffes are herbivores, primarily feeding on the leaves of trees while using their long tongues to reach high branches.",
      "habitat": "Savannas and open woodlands.",
      "diet": "Herbivore - primarily feeds on acacia leaves and other foliage.",
      "fun_facts": [
        "A giraffe's tongue can be up to 45 cm long and is prehensile.",
        "They can go several days without drinking water, obtaining moisture from leaves.",
        "Giraffes communicate with each other using a variety of vocalizations, including grunts and hisses."
      ],
      "population": "Estimated 68,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1805574810/photo/animals-in-the-wild-reticulated-giraffe-samburu-national-reserve-north-kenya.webp?a=1&b=1&s=612x612&w=0&k=20&c=VWqUISIFhBYE0hKsuvzef_WizP_J0zysYj8uId5xNbk="
    },
    {
      "id": "7",
      "likes": 702,
      "name": "Hippopotamus",
      "scientific_name": "Hippopotamus amphibius",
      "category": "mammal",
      "description": "Hippos are large, mostly herbivorous mammals, known for their massive bodies and large mouths. They spend most of their time in water to keep their bodies cool, emerging at night to graze on grass. Despite their size, hippos are known to be highly territorial and can be aggressive when threatened.",
      "habitat": "Rivers and lakes across sub-Saharan Africa.",
      "diet": "Herbivore - primarily grazes on grasses.",
      "fun_facts": [
        "Despite being semi-aquatic, hippos can run at speeds of up to 19 mph on land.",
        "Hippos secrete a natural sunscreen that protects them from sunburn.",
        "They can hold their breath underwater for up to five minutes."
      ],
      "population": "Estimated 125,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1375718469/photo/hippopotamus-walking-with-a-cattle-egret.webp?a=1&b=1&s=612x612&w=0&k=20&c=_vIZlqTqUpfgaumUxu_6kWUssWP8TRDe_xz5WCYv4Fk="
    },
    {
      "id": "8",
      "likes": 1007,
      "name": "Zebra",
      "scientific_name": "Equus quagga",
      "category": "mammal",
      "description": "Zebras are known for their distinctive black and white stripes, which serve as camouflage in the wild. They are social animals that live in herds and are primarily grazers, feeding on grass and other vegetation. Each zebra has a unique stripe pattern, much like human fingerprints.",
      "habitat": "Savannas, grasslands, and woodlands.",
      "diet": "Herbivore - primarily grazes on grass.",
      "fun_facts": [
        "Zebras communicate through vocalizations, body language, and facial expressions.",
        "They have excellent eyesight, which helps them keep watch for predators.",
        "Zebras are known to form strong social bonds and can often be seen grooming each other."
      ],
      "population": "Estimated 300,000 plains zebras in the wild.",
      "image_url": "https://media.istockphoto.com/id/2172882241/photo/portrait-of-symbiotic-zebra-and-egret-east-africa.webp?a=1&b=1&s=612x612&w=0&k=20&c=nvssjH91cssmf10XPskUQ51ECYVzAwx79DhSMgCmGWA="
    },
    {
      "id": "9",
      "likes": 1050,
      "name": "Kangaroo",
      "scientific_name": "Macropus giganteus",
      "category": "mammal",
      "description": "Kangaroos are marsupials native to Australia, recognizable by their strong hind legs and long tails. They are unique in their ability to jump great distances and are known for their strong social structures, often living in groups called mobs. Kangaroos are herbivores, feeding mainly on grasses and leaves.",
      "habitat": "Grasslands and forests across Australia.",
      "diet": "Herbivore - primarily feeds on grass, leaves, and shoots.",
      "fun_facts": [
        "Kangaroos can jump up to 3 meters high and cover 9 meters in a single leap.",
        "They are the only large animals that use hopping as their primary means of locomotion.",
        "Kangaroos can maintain a steady speed while hopping for long periods."
      ],
      "population": "Estimated 50 million in the wild.",
      "image_url": "https://media.istockphoto.com/id/2167623509/photo/kangaroos-in-field.webp?a=1&b=1&s=612x612&w=0&k=20&c=NUxT3M90h3MPuQ_vKpnrN1W7xy3zsLlbdrslZzodkX0="
    },
    {
      "id": "10",
      "likes": 1000,
      "name": "Polar Bear",
      "scientific_name": "Ursus maritimus",
      "category": "mammal",
      "description": "Polar bears are the largest land carnivores, known for their thick white fur that provides insulation in frigid Arctic climates. They are excellent swimmers and depend mainly on sea ice for hunting seals, their primary food source. Due to climate change, polar bears face significant challenges as their habitat continues to shrink.",
      "habitat": "Arctic regions, primarily on sea ice.",
      "diet": "Carnivore - primarily feeds on seals.",
      "fun_facts": [
        "Polar bears can swim for days at a time to find food.",
        "Their skin is black under their fur, which helps absorb heat.",
        "Polar bears can overheat despite living in cold environments due to their thick layer of fat."
      ],
      "population": "Estimated 26,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/2188708235/photo/polar-bear-ursus-maritimus-and-the-red-rock-mountains-of-vikinge-bay-scoresby-sund-greenland.webp?a=1&b=1&s=612x612&w=0&k=20&c=nSx2gYblB6D39bNUiISCB8awz74RX_rvC2q8EMiBsQA="
    },
    {
      "id": "11",
      "likes": 694,
      "name": "Komodo Dragon",
      "scientific_name": "Varanus komodoensis",
      "category": "reptile",
      "description": "The Komodo dragon is the world's largest living lizard and is known for its formidable size and predatory behavior. Native to the Indonesian islands, these reptiles are powerful hunters with sharp claws and a toxic bite. They use their keen sense of smell to locate prey, which can include large mammals.",
      "habitat": "Dry, grassy savannas and tropical forests on the islands of Komodo, Rinca, Flores, and Gili Motang.",
      "diet": "Carnivore - primarily feeds on deer, birds, and carrion.",
      "fun_facts": [
        "Komodo dragons can run up to 13 mph over short distances.",
        "They have a keen sense of smell, allowing them to detect carrion from miles away.",
        "These lizards can weigh up to 200 pounds."
      ],
      "population": "Estimated 3,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/676518196/photo/komodo-dragon-is-on-the-ground.webp?a=1&b=1&s=612x612&w=0&k=20&c=OsWHo3syQxffJtH2G5u2IzV8Xg2IBDzuYQg6_MKajVc="
    },
    {
      "id": "12",
      "likes": 1670,
      "name": "Monarch Butterfly",
      "scientific_name": "Danaus plexippus",
      "category": "insect",
      "description": "The monarch butterfly is known for its remarkable migration journey, traveling thousands of miles from North America to central Mexico each winter to escape the cold. Their striking orange and black wing patterns warn predators of their toxicity. As adults, they primarily feed on nectar.",
      "habitat": "Fields, meadows, and gardens across North America.",
      "diet": "Herbivore - feeds on nectar from various flowering plants.",
      "fun_facts": [
        "Monarchs can live up to 9 months during their migratory phase.",
        "Their migration is one of the longest of any insect, covering up to 3,000 miles.",
        "The lifecycle includes four stages: egg, larva (caterpillar), pupa (chrysalis), and adult."
      ],
      "population": "Estimated 30 million during migration season.",
      "image_url": "https://media.istockphoto.com/id/1336791163/photo/monarch-on-a-black-eyed-susan-flower.webp?a=1&b=1&s=612x612&w=0&k=20&c=t8OmW6yNCD9FNNv2R20r_9GsqKmAqBs034VRu6fhavE="
    },
    {
      "id": "13",
      "likes": 1069,
      "name": "Blue Whale",
      "scientific_name": "Balaenoptera musculus",
      "category": "mammal",
      "description": "The blue whale is the largest animal known to have ever existed, reaching lengths of up to 100 feet and weights of over 200 tons. They are known for their deep blue color, which may appear lighter underwater. Blue whales communicate with low-frequency sounds that can travel long distances in the ocean.",
      "habitat": "Oceans worldwide, traveling between feeding and breeding grounds.",
      "diet": "Carnivore - primarily feeds on krill and small fish.",
      "fun_facts": [
        "A blue whale's heart can weigh as much as a small car.",
        "They can consume up to 4 tons of krill a day during feeding season.",
        "Blue whales are known for their long migrations, traveling thousands of miles each year."
      ],
      "population": "Estimated 10,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/2170573114/photo/blue-whale-diving-deep-underwater.webp?a=1&b=1&s=612x612&w=0&k=20&c=1FWi5o1yUPAVUGCKjAoiWadprI0y8t5-3lKv8nwoyZs="
    },
    {
      "id": "14",
      "likes": 609,
      "name": "Green Anaconda",
      "scientific_name": "Eunectes murinus",
      "category": "reptile",
      "description": "The green anaconda is one of the largest and heaviest snakes in the world, known for its impressive girth and camouflage abilities in the water. Native to the swamps and rivers of South America, they are constrictors, preying on a variety of animals, including fish, birds, and mammals.",
      "habitat": "Swamps, marshes, and slow-moving streams in the Amazon basin.",
      "diet": "Carnivore - feeds on fish, birds, small mammals, and occasionally larger animals like capybaras.",
      "fun_facts": [
        "Green anacondas can grow up to 30 feet long.",
        "They are mainly nocturnal, hunting at night in their aquatic habitats.",
        "Green anacondas are less aggressive than their reputation suggests, often avoiding encounters with humans."
      ],
      "population": "Population numbers are unknown, but they are not considered endangered.",
      "image_url": "https://media.istockphoto.com/id/836061794/photo/amazon-creatures.webp?a=1&b=1&s=612x612&w=0&k=20&c=ApLj9hAeuSE_e6fUzMm0GgHsSYvjqFCDW4yeNVryTTU="
    },
    {
      "id": "15",
      "likes": 2069,
      "name": "Snow Leopard",
      "scientific_name": "Panthera uncia",
      "category": "mammal",
      "description": "Snow leopards are medium-sized big cats that inhabit the mountainous regions of Central and South Asia. Known for their thick fur, long tails, and stunning green eyes, they are highly adapted to cold, rugged environments. Snow leopards are solitary animals and are skilled climbers, making them perfectly suited to their rocky habitats.",
      "habitat": "Mountain ranges in Central and South Asia, particularly in the Himalayas.",
      "diet": "Carnivore - primarily feeds on blue sheep, ibex, and various mountain ungulates.",
      "fun_facts": [
        "Snow leopards can leap up to six times their body length in one jump.",
        "They have large nasal cavities that help warm cold air before it enters their lungs.",
        "Snow leopards are known for their elusive nature, making them difficult to study."
      ],
      "population": "Estimated 4,000-6,500 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1716065047/photo/a-rare-look-at-the-majestic-snow-leopards-captivating-beauty.webp?a=1&b=1&s=612x612&w=0&k=20&c=nXOxAzFT1aRZDYJWuHgV4fcOMEg-SUwTM7TMGSZSnwY="
    },
    {
      "id": "16",
      "likes": 770,
      "name": "Rhinoceros",
      "scientific_name": "Rhinocerotidae",
      "category": "mammal",
      "description": "Rhinoceroses are large, thick-skinned herbivores known for their distinctive horns, which are made of keratin, the same material as human hair and nails. They can be found in various habitats, including grasslands and forests, and are often solitary animals. Rhinos play a crucial role in their ecosystems by grazing and helping to maintain the health of grasslands.",
      "habitat": "Grasslands, savannas, and tropical forests.",
      "diet": "Herbivore - primarily feeds on grasses, leaves, and shrubs.",
      "fun_facts": [
        "The white rhino is the largest species, weighing up to 2,300 kg (5,000 lbs).",
        "Rhinos have poor eyesight but an excellent sense of smell.",
        "They can run at speeds of up to 30 mph."
      ],
      "population": "Estimated 27,000 white rhinos in the wild.",
      "image_url": "https://media.istockphoto.com/id/1185317987/photo/mother-and-baby-rhino-getting-ready-to-drink.webp?a=1&b=1&s=612x612&w=0&k=20&c=oSQ2NAmTfEVa_YLdU818_p5aKOfaQpvALoLEQO5HCYM="
    },
    {
      "id": "17",
      "likes": 870,
      "name": "Gorilla",
      "scientific_name": "Gorilla gorilla",
      "category": "mammal",
      "description": "Gorillas are the largest of all primates, known for their strength and social behavior. They live in family groups led by a dominant male called a silverback. Gorillas are primarily herbivorous, feeding on leaves, fruits, and stems. Their gentle nature often belies their size and strength.",
      "habitat": "Tropical forests and rainforests in Africa.",
      "diet": "Herbivore - primarily feeds on leaves, stems, fruit, and flowers.",
      "fun_facts": [
        "Gorillas are highly intelligent animals that can use tools and learn sign language.",
        "They can weigh up to 180 kg (400 lbs) and can be over 6 feet tall.",
        "Gorillas are known for their strong maternal bonds and care for their young."
      ],
      "population": "Estimated 100,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/683300744/photo/rwanda-gorilla-still.webp?a=1&b=1&s=612x612&w=0&k=20&c=XMtJtfe73vwRGEULPaxvykBIApJ9UETfwwYAg2FRZ24="
    },
    {
      "id": "18",
      "likes": 770,
      "name": "Chimpanzee",
      "scientific_name": "Pan troglodytes",
      "category": "mammal",
      "description": "Chimpanzees are highly intelligent primates and share about 98% of their DNA with humans. They are known for their complex social structures, using tools, and their ability to communicate through gestures and vocalizations. Chimpanzees are both tree-dwelling and ground-dwelling.",
      "habitat": "Tropical rainforests and savannas in Africa.",
      "diet": "Omnivore - feeds on fruits, leaves, seeds, and occasionally small mammals.",
      "fun_facts": [
        "Chimpanzees can use tools, such as sticks to access termites for food.",
        "They live in large communities and have complex social interactions.",
        "They can communicate using a variety of sounds, gestures, and facial expressions."
      ],
      "population": "Estimated 150,000-250,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1361427581/photo/a-chimpanzee-family-mahale-mountain-national-park-tanzania.webp?a=1&b=1&s=612x612&w=0&k=20&c=g2FbSJ2cSlmTP43KadbvMXtibcHP_nwScASb6f2f0Q0="
    },
    {
      "id": "19",
      "likes": 970,
      "name": "Orangutan",
      "scientific_name": "Pongo pygmaeus",
      "category": "mammal",
      "description": "Orangutans are highly intelligent and social apes native to the rainforests of Borneo and Sumatra. Known for their reddish-brown fur and long arms, they spend most of their lives in trees. Orangutans have a strong maternal bond with their young, with infants remaining dependent for years.",
      "habitat": "Tropical rainforests of Borneo and Sumatra.",
      "diet": "Herbivore - primarily feeds on fruit, leaves, and bark.",
      "fun_facts": [
        "Orangutans are known to use leaves as tools for feeding or shelter.",
        "They can live for up to 30-40 years in the wild.",
        "Mother orangutans only give birth to one infant every 6-8 years."
      ],
      "population": "Estimated 55,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/146887289/photo/young-orangutan-sitting-on-the-tree.webp?a=1&b=1&s=612x612&w=0&k=20&c=2xMcO13nxrRFE1OPynTkVf8fddIVznzFvNN8a2UKA98="
    },
    {
      "id": "20",
      "likes": 1570,
      "name": "Koala",
      "scientific_name": "Phascolarctos cinereus",
      "category": "mammal",
      "description": "Koalas are marsupials found in Australia, recognized for their distinctive round faces, large ears, and plush fur. They spend most of their lives in eucalyptus trees, eating leaves that are toxic to most other animals. Koalas are nocturnal and sleep for a significant portion of the day, conserving energy.",
      "habitat": "Eucalyptus forests in Australia.",
      "diet": "Herbivore - primarily feeds on eucalyptus leaves.",
      "fun_facts": [
        "Koalas can sleep up to 18 hours a day to conserve energy.",
        "They have a highly developed sense of smell that helps them select the best eucalyptus leaves.",
        "Despite their cute appearance, koalas can be quite aggressive when threatened."
      ],
      "population": "Estimated 80,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1326007751/photo/koala-on-eucalyptus-tree-outdoor-in-australia.webp?a=1&b=1&s=612x612&w=0&k=20&c=bLY7pm2bu3_NfDKbcNS_ACfDUOn1A2nNyCG9X_R-Cmo="
    },
    {
      "id": "21",
      "likes": 1750,
      "name": "Panda",
      "scientific_name": "Ailuropoda melanoleuca",
      "category": "mammal",
      "description": "Giant pandas are bear species native to China, known for their distinctive black and white coloring. They primarily eat bamboo, and their diet consists almost entirely of this plant, requiring them to consume large amounts daily to meet their energy needs. Pandas are often seen as a symbol of wildlife conservation.",
      "habitat": "Bamboo forests in the mountainous regions of China.",
      "diet": "Herbivore - primarily feeds on bamboo, but also consumes fruits and vegetables.",
      "fun_facts": [
        "Giant pandas can eat up to 38 kg (84 lbs) of bamboo in a single day.",
        "They have a specialized wrist bone that allows them to grasp bamboo efficiently.",
        "Pandas are excellent climbers and spend much of their time in trees."
      ],
      "population": "Estimated 1,864 in the wild.",
      "image_url": "https://media.istockphoto.com/id/2167736864/photo/panda-sleeping-on-branch-at-zoo.webp?a=1&b=1&s=612x612&w=0&k=20&c=18NSaYIBKcxoLnbtKnPhaxTOPOU8_fb-FcXV8s_326A="
    },
    {
      "id": "22",
      "likes": 1170,
      "name": "Brown Bear",
      "scientific_name": "Ursus arctos",
      "category": "mammal",
      "description": "Brown bears are large mammals found in North America, Europe, and Asia. They are known for their strength and size, with some individuals weighing over 600 pounds. Brown bears have a diverse diet, often foraging for berries, plants, fish, and small mammals. They are also known for their impressive hibernation habits during winter.",
      "habitat": "Forests, mountains, and tundra areas.",
      "diet": "Omnivore - feeds on berries, plants, fish, and small mammals.",
      "fun_facts": [
        "Brown bears can run at speeds of up to 30 mph.",
        "Hibernating bears can lose up to 30 percent of their body weight during winter.",
        "They can be territorial and are known for their aggressive behavior when threatened."
      ],
      "population": "Estimated 200,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1421052567/photo/brown-bear-on-a-rock.webp?a=1&b=1&s=612x612&w=0&k=20&c=2pl2U6cCKRzvbGr2RsUhcyay5A1WtWni2YjDgjBd0vk="
    },
    {
      "id": "23",
      "likes": 2070,
      "name": "Wolf",
      "scientific_name": "Canis lupus",
      "category": "mammal",
      "description": "Wolves are highly social animals that live and hunt in packs. Known for their intelligence and communication skills, they use vocalizations, body language, and scent marking to coordinate hunting efforts. Wolves primarily prey on ungulates but will scavenge when larger prey is scarce.",
      "habitat": "Forests, grasslands, and tundras across North America and Eurasia.",
      "diet": "Carnivore - primarily feeds on deer, elk, and smaller mammals.",
      "fun_facts": [
        "Wolves communicate using a variety of vocalizations, including howls and growls.",
        "They can travel long distances when searching for food, up to 12 miles in a day.",
        "Wolves establish strong family bonds, often living with their pack for life."
      ],
      "population": "Estimated 200,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1768770924/photo/canadian-timberwolf.webp?a=1&b=1&s=612x612&w=0&k=20&c=PO31PcnOjX-tzfbHIUQxMFDjbwReZIr9_417jtoqHPo="
    },
    {
      "id": "24",
      "likes": 970,
      "name": "Fox",
      "scientific_name": "Vulpes vulpes",
      "category": "mammal",
      "description": "Foxes are small to medium-sized omnivores known for their cunning nature and adaptability to different environments. They have sharp hearing and excellent night vision, which makes them effective hunters. Red foxes are the most common species, recognized by their bushy tails and vibrant reddish-orange fur.",
      "habitat": "Forests, grasslands, mountains, and urban areas worldwide.",
      "diet": "Omnivore - feeds on small mammals, birds, fruits, and insects.",
      "fun_facts": [
        "Foxes can use their tails for balance and communication.",
        "They have a unique hunting technique known as 'mousing' where they leap to catch prey beneath the snow.",
        "Foxes are known for their playful behavior and social interactions."
      ],
      "population": "Estimated 7 million in the wild.",
      "image_url": "https://media.istockphoto.com/id/1404698627/photo/mama-fox-posing-with-her-baby-kit.webp?a=1&b=1&s=612x612&w=0&k=20&c=OnpzdVIyCMBajGIUoULeKybzGH5VafpxbOZmWeyWdm8="
    },
    {
      "id": "25",
      "likes": 1070,
      "name": "Sloth",
      "scientific_name": "Folivora",
      "category": "mammal",
      "description": "Sloths are slow-moving mammals found in Central and South American forests. They are known for their unique adaptations to a low-energy lifestyle, including a diet that primarily consists of leaves. Sloths spend most of their time hanging upside down in trees, where they feel safe from predators.",
      "habitat": "Tropical rainforests in Central and South America.",
      "diet": "Herbivore - primarily feeds on leaves, fruits, and flowers.",
      "fun_facts": [
        "Sloths can take up to a month to digest a single meal.",
        "They have a low metabolic rate, which helps them conserve energy.",
        "Sloths are excellent swimmers and can hold their breath for up to 40 minutes."
      ],
      "population": "Population numbers are not well known, but some species are at risk.",
      "image_url": "https://media.istockphoto.com/id/1587529291/photo/brown-throated-sloth-stock-photo.webp?a=1&b=1&s=612x612&w=0&k=20&c=oV_dipi_WvebEHLI38daWnyqie202tesvYwbz91ITfQ="
    },
    {
      "id": "26",
      "likes": 2070,
      "name": "Dolphin",
      "scientific_name": "Delphinidae",
      "category": "mammal",
      "description": "Dolphins are intelligent marine mammals known for their playful behavior and social structures. They utilize echolocation to navigate and hunt for fish and squid in the ocean. Dolphins live in pods that can consist of a few individuals to several hundred, and they often exhibit cooperative hunting strategies.",
      "habitat": "Warm and temperate oceans worldwide.",
      "diet": "Carnivore - primarily feeds on fish, squid, and crustaceans.",
      "fun_facts": [
        "Dolphins can communicate with each other using a variety of sounds and clicks.",
        "They are known for surfing on waves and playing with boats.",
        "Dolphins have been observed exhibiting altruistic behavior, helping injured individuals."
      ],
      "population": "Estimated several million across various species.",
      "image_url": "https://media.istockphoto.com/id/2170315506/photo/view-of-a-dolphin-in-the-sea.webp?a=1&b=1&s=612x612&w=0&k=20&c=RLOlIrs8g6OStJt26BaLuiXlpPl52oYUkA0Z06php64="
    },
    {
      "id": "28",
      "likes": 2170,
      "name": "Orca (Killer Whale)",
      "scientific_name": "Orcinus orca",
      "category": "mammal",
      "description": "Orcas, or killer whales, are the largest members of the dolphin family. Known for their black and white coloring and striking appearance, they are highly social animals that live in pods. Orcas have diverse diets, feeding on fish, seals, and even larger whales, depending on their hunting strategies.",
      "habitat": "Cold and temperate oceans worldwide.",
      "diet": "Carnivore - feeds primarily on fish, but also seals, seabirds, and whales.",
      "fun_facts": [
        "Orcas can communicate using distinct calls known as 'dialects' among different pods.",
        "They are known for their sophisticated hunting techniques and group cooperation.",
        "Orcas can live for over 90 years in the wild."
      ],
      "population": "Estimated 50,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1502540292/photo/portait-of-orca-in-norway.webp?a=1&b=1&s=612x612&w=0&k=20&c=DtKZ6-Jic0pOfM7IH_colwQ1krLXOUo_nCqJ-sLlt8c="
    },
    {
      "id": "29",
      "likes": 2270,
      "name": "Red Panda",
      "scientific_name": "Ailurus fulgens",
      "category": "mammal",
      "description": "Red pandas are small, tree-dwelling mammals native to the eastern Himalayas and southwestern China. They are known for their reddish-brown fur, bushy tails, and adorable faces. Unlike their giant counterparts, red pandas are herbivores that primarily feed on bamboo, but they will also eat fruits and insects.",
      "habitat": "Temperate forests in the eastern Himalayas.",
      "diet": "Herbivore - primarily feeds on bamboo, fruits, and small insects.",
      "fun_facts": [
        "Red pandas are excellent climbers and spend most of their lives in trees.",
        "They have a unique wrist bone that acts as a thumb, aiding in climbing and holding food.",
        "Red pandas are more closely related to raccoons than to giant pandas."
      ],
      "population": "Estimated 10,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/147050490/photo/red-panda-in-a-tree-looking-at-the-camera.webp?a=1&b=1&s=612x612&w=0&k=20&c=8joDkS-Ucxc2ArmpouWLAmR824wJb77BGvvPo2HJhUc="
    },
    {
      "id": "30",
      "likes": 1699,
      "name": "Arctic Fox",
      "scientific_name": "Vulpes lagopus",
      "category": "mammal",
      "description": "The Arctic fox is a small, adaptable fox species found in the Arctic and subarctic regions. They are known for their thick white fur in winter, which provides insulation against the cold and camouflage against the snow. In summer, their fur turns a browner color. Arctic foxes are opportunistic feeders, preying on small mammals, birds, and scavenging.",
      "habitat": "Tundra and coastal regions in the Arctic.",
      "diet": "Omnivore - feeds on small mammals, birds, and carrion.",
      "fun_facts": [
        "Arctic foxes can lower their body temperature to survive in extreme cold.",
        "They have keen hearing and can locate prey buried under the snow.",
        "Their fur changes color with the seasons, providing effective camouflage."
      ],
      "population": "Estimated several hundred thousand in the wild.",
      "image_url": "https://media.istockphoto.com/id/157305552/photo/polar-fox.webp?a=1&b=1&s=612x612&w=0&k=20&c=A0EQ_zJ2EVS0YPUMmFXVcjcbvEtZo_yhHF0LKMa--98="
    },
    {
      "id": "31",
      "likes": 570,
      "name": "Hyena",
      "scientific_name": "Hyaenidae",
      "category": "mammal",
      "description": "Hyenas are carnivorous mammals known for their scavenging habits and complex social structures. Often regarded as scavengers, they are also skilled hunters, preying on various animals. Hyenas have strong jaws and are known for their distinctive vocalizations, including their famous 'laugh.'",
      "habitat": "Grasslands, savannas, and woodlands in Africa.",
      "diet": "Carnivore - primarily feeds on carrion but also hunts prey.",
      "fun_facts": [
        "Hyenas can consume bones and tough hides due to their powerful jaws.",
        "They are known for their complex social hierarchies and cooperative hunting strategies.",
        "Hyenas can run for long distances at speeds of up to 30 mph."
      ],
      "population": "Estimated several hundred thousand in the wild.",
      "image_url": "https://media.istockphoto.com/id/1391602527/photo/hyena-on-the-open-savannah.webp?a=1&b=1&s=612x612&w=0&k=20&c=FqLJr1dR0NdPg_pucrSR4aMVSbARnZXStIXA_XB7U8w="
    },
    {
      "id": "32",
      "likes": 1070,
      "name": "Bison",
      "scientific_name": "Bison bison",
      "category": "mammal",
      "description": "Bison are large, herbivorous mammals that once roamed the plains of North America in vast herds. Known for their massive size, woolly coats, and curved horns, bison are adaptable creatures that graze on grasses and other vegetation. They play a crucial role in maintaining the health of the prairie ecosystem.",
      "habitat": "Grasslands and plains in North America.",
      "diet": "Herbivore - primarily feeds on grasses and sedges.",
      "fun_facts": [
        "Bison can weigh up to 2,000 pounds and run at speeds of 35 mph.",
        "They are social animals that live in herds, often led by a dominant female.",
        "Bison have a unique digestive system that allows them to efficiently break down tough plant material."
      ],
      "population": "Estimated 500,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/2167485825/photo/a-portrait-of-a-male-bison-in-yellowstone-national-park.webp?a=1&b=1&s=612x612&w=0&k=20&c=MAB8VaOvF4tmi8X4lgnXyErD6gc3jT5YSThyh1VvY8o="
    },
    {
      "id": "33",
      "likes": 2000,
      "name": "Otter",
      "scientific_name": "Lutrinae",
      "category": "mammal",
      "description": "Otters are playful, aquatic mammals known for their streamlined bodies, webbed feet, and thick fur. They are often found near rivers, lakes, and coastal areas. Otters are social animals that can live in family groups and are skilled hunters, primarily feeding on fish, crustaceans, and small mammals.",
      "habitat": "Freshwater and coastal areas worldwide.",
      "diet": "Carnivore - primarily feeds on fish, crustaceans, and other aquatic animals.",
      "fun_facts": [
        "Otters use rocks to crack open shellfish, showcasing their tool-using abilities.",
        "They have a unique grooming behavior to keep their fur waterproof.",
        "Otters can hold their breath underwater for up to 5 minutes."
      ],
      "population": "Population numbers vary by species; North American river otters are common.",
      "image_url": "https://media.istockphoto.com/id/2148757239/photo/asian-small-clawed-otter.webp?a=1&b=1&s=612x612&w=0&k=20&c=RuWhZ6RHcgSGMwba7iKrJTCTkmxN-Nk5nnxVb4IAqrs="
    },
    {
      "id": "34",
      "likes": 70,
      "name": "Armadillo",
      "scientific_name": "Dasypodidae",
      "category": "mammal",
      "description": "Armadillos are unique mammals known for their shell-like armor, made of bony plates. They are primarily nocturnal and are found in a variety of habitats, including grasslands and forests. Most commonly associated with the nine-banded armadillo, they are insectivorous and also feed on plants.",
      "habitat": "Grasslands, forests, and shrublands in the Americas.",
      "diet": "Insectivore - primarily feeds on insects, grubs, and plants.",
      "fun_facts": [
        "Armadillos can roll into a ball for protection against predators.",
        "They have a keen sense of smell, which helps them locate food.",
        "Nine-banded armadillos are known for their ability to carry leprosy bacteria without showing symptoms."
      ],
      "population": "Estimated in the millions across various species.",
      "image_url": "https://media.istockphoto.com/id/151919834/photo/armadillo-in-grass-field.webp?a=1&b=1&s=612x612&w=0&k=20&c=iNeaHX1vzPuFetE7I5N3GKLt49FodV-s0J_--pal8n4="
    },
    {
      "id": "35",
      "likes": 1070,
      "name": "Capybara",
      "scientific_name": "Hydrochoerus hydrochaeris",
      "category": "mammal",
      "description": "Capybaras are the world's largest rodents, known for their semi-aquatic lifestyle and social behavior. They live in groups near water bodies and are highly adaptable, feeding on grasses and aquatic plants. Capybaras are known for their calm demeanor and friendly interactions with other species.",
      "habitat": "Wetlands, rivers, and grasslands in South America.",
      "diet": "Herbivore - primarily feeds on grasses and aquatic plants.",
      "fun_facts": [
        "Capybaras can weigh up to 150 pounds and reach lengths of about 4 feet.",
        "They have webbed feet, which help them swim efficiently.",
        "Capybaras are known to be social animals, often seen grooming each other."
      ],
      "population": "Estimated 1 million in the wild.",
      "image_url": "https://media.istockphoto.com/id/1418210562/photo/brazil-wildlife-capybara-hydrochoerus-hydrochaeris-biggest-mouse-near-the-water-with-evening.webp?a=1&b=1&s=612x612&w=0&k=20&c=WGUF6EoYrz6n1tGsnKaPJSI7UxvXWe3tvM_igGpWwro="
    },
    {
      "id": "36",
      "likes": 1040,
      "name": "Wombat",
      "scientific_name": "Vombatidae",
      "category": "mammal",
      "description": "Wombats are stout, burrowing marsupials native to Australia. They are known for their strong, built bodies and the ability to dig extensive burrow systems. Wombats primarily feed on grasses and herbs and have a unique digestive system that allows them to extract maximum nutrients from their fibrous diet.",
      "habitat": "Forests, grasslands, and mountainous areas of Australia.",
      "diet": "Herbivore - primarily feeds on grasses, roots, and bark.",
      "fun_facts": [
        "Wombats have cube-shaped poop, which prevents it from rolling away and helps mark territory.",
        "They can run at speeds of up to 25 mph.",
        "Wombats are nocturnal and spend most of their time foraging for food."
      ],
      "population": "Estimated 90,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/527218926/photo/wombat.webp?a=1&b=1&s=612x612&w=0&k=20&c=G8zvyQF0tUxHFlgpz-TId_5sV-CVA6xOM3Mw30EHYHU="
    },
    {
      "id": "38",
      "likes": 1920,
      "name": "Peregrine Falcon",
      "scientific_name": "Falco peregrinus",
      "category": "bird",
      "description": "The peregrine falcon is renowned for being the fastest bird in the world, capable of reaching speeds over 240 mph during its hunting stoop (high-speed dive). This bird of prey is recognized for its distinctive blue-gray feathers and black markings. They are known for their incredible hunting skills and adaptability to various environments.",
      "habitat": "Urban areas, cliffs, and open fields worldwide.",
      "diet": "Carnivore - primarily feeds on other birds.",
      "fun_facts": [
        "Peregrine falcons can spot prey from a distance of over a mile.",
        "They are capable of rapid dives, which help them catch fast-moving prey.",
        "Peregrines are known to adapt to urban environments, nesting on tall buildings and bridges."
      ],
      "population": "Estimated 1.5 million worldwide.",
      "image_url": "https://media.istockphoto.com/id/2151732091/photo/peregrine-falcon-wings.webp?a=1&b=1&s=612x612&w=0&k=20&c=lRGzSwPgB9aP8QLk1iCWTbT36dEFUlhJxkoF0aUX8Hw="
    },
    {
      "id": "39",
      "likes": 1370,
      "name": "Barn Owl",
      "scientific_name": "Tyto alba",
      "category": "bird",
      "description": "Barn owls are known for their heart-shaped faces and distinctive white and golden plumage. They are nocturnal birds of prey, primarily hunting small mammals like voles and mice. Their silent flight and excellent hearing make them highly effective hunters in low-light conditions.",
      "habitat": "Open fields, farmlands, and barns across the world.",
      "diet": "Carnivore - mainly feeds on small rodents and small mammals.",
      "fun_facts": [
        "Barn owls can hunt prey in complete darkness, aided by their exceptional hearing.",
        "They are often found nesting in abandoned buildings and grain stores.",
        "The barn owl's call is a distinct screech, unlike the typical hoot of other owls."
      ],
      "population": "Estimated 1 million in the wild.",
      "image_url": "https://media.istockphoto.com/id/1391564461/photo/barn-owl-sitting-in-a-tree.webp?a=1&b=1&s=612x612&w=0&k=20&c=hTTDLK0nO0pAtb6ZJUl8x-4NQsz2PxAQqGu5Jl5zSmw="
    },
    {
      "id": "40",
      "likes": 1069,
      "name": "Snowy Owl",
      "scientific_name": "Bubo scandiacus",
      "category": "bird",
      "description": "Snowy owls are large, white owls known for their striking appearance and powerful presence. Native to the Arctic regions, they are well-adapted to cold environments. Snowy owls primarily hunt small mammals like lemmings, and they are known for their impressive flying abilities.",
      "habitat": "Tundra regions, particularly in the Arctic.",
      "diet": "Carnivore - primarily feeds on small mammals like lemmings.",
      "fun_facts": [
        "Snowy owls have a unique feather structure that provides insulation in frigid temperatures.",
        "They can hunt both during the day and night, unlike many other owl species.",
        "The male snowy owl is predominantly white, while females have darker markings."
      ],
      "population": "Estimated 200,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1253654256/photo/snowy-owl-hovering-bird-in-flight.webp?a=1&b=1&s=612x612&w=0&k=20&c=gXBTN-1nNqheSr5pzIpgF3zFdHMT7bUN7phnTVIpnxg="
    },
    {
      "id": "41",
      "likes": 1370,
      "name": "Flamingo",
      "scientific_name": "Phoenicopteridae",
      "category": "bird",
      "description": "Flamingos are large wading birds known for their distinctive pink color and long legs. Their coloration comes from the carotenoid pigments in their diet of algae and crustaceans. Flamingos are highly social birds that often congregate in large colonies, exhibiting elaborate courtship displays.",
      "habitat": "Shallow lakes, lagoons, and mudflats.",
      "diet": "Herbivore - primarily feeds on algae, crustaceans, and small invertebrates.",
      "fun_facts": [
        "Flamingos can filter-feed by lowering their heads in the water and using their specialized beaks.",
        "They can stand on one leg for extended periods, resting the other leg.",
        "Flamingos are known for their vibrant display rituals during mating season."
      ],
      "population": "Estimated 2 million in the wild.",
      "image_url": "https://media.istockphoto.com/id/1391139667/photo/colorful-flamingos-feeding.webp?a=1&b=1&s=612x612&w=0&k=20&c=j9qKY8OAmeHn0wbtmQptBpodbh92x3zqvbBpJdL4Zlc="
    },
    {
      "id": "42",
      "likes": 1470,
      "name": "Peacock",
      "scientific_name": "Pavo cristatus",
      "category": "bird",
      "description": "Peacocks are large, colorful birds known for their extravagant tail feathers, which they fan out during courtship displays. Native to South Asia, the male peacock is known for its striking plumage, while females, called peahens, are less colorful. Peacocks are ground birds that can fly short distances.",
      "habitat": "Forests and open areas in South Asia.",
      "diet": "Omnivore - feeds on insects, plants, and small animals.",
      "fun_facts": [
        "Peacocks can display their feathers to attract mates, showcasing eye-catching patterns.",
        "Their calls can be heard from over a mile away, often sounding like loud honks.",
        "Peafowl (the term for peacocks and peahens) have been kept as pets for thousands of years."
      ],
      "population": "Estimated several million in the wild.",
      "image_url": "https://media.istockphoto.com/id/180699358/photo/peacock.webp?a=1&b=1&s=612x612&w=0&k=20&c=lWS-hiJ_OQF5D628tQ-nucxhZoHQMReITo4V2ciB0K4="
    },
    {
      "id": "43",
      "likes": 1570,
      "name": "Ostrich",
      "scientific_name": "Struthio camelus",
      "category": "bird",
      "description": "Ostriches are the largest living birds, native to Africa. They are flightless but are excellent runners, capable of reaching speeds up to 45 mph. With their long necks and legs, ostriches are well-adapted to the open savannas where they live, often foraging for seeds, plants, and insects.",
      "habitat": "Savannas and grasslands in Africa.",
      "diet": "Herbivore - primarily feeds on seeds, plants, and insects.",
      "fun_facts": [
        "Ostriches can lay the largest eggs of any bird, weighing up to 3 lbs.",
        "They have a unique two-toed foot structure, which helps with balance and running.",
        "Despite their size, ostriches can be elusive and are capable of hiding from predators."
      ],
      "population": "Estimated 1.6 million in the wild.",
      "image_url": "https://media.istockphoto.com/id/1444328447/photo/female-ostrich-in-natural-habitat-kalahari-desert-south-africa.webp?a=1&b=1&s=612x612&w=0&k=20&c=dTd653izoXJrIC1lqZ3iBPWDtpKyFOx7yurUSNOj268="
    },
    {
      "id": "44",
      "likes": 1120,
      "name": "Emu",
      "scientific_name": "Dromaius novaehollandiae",
      "category": "bird",
      "description": "Emus are large, flightless birds native to Australia, recognized for their long necks and legs. They are the second-largest birds in the world after ostriches and are known for their soft, shaggy feathers. Emus are social creatures often found in small groups, foraging for seeds, fruits, and insects.",
      "habitat": "Open forests, grasslands, and scrubland in Australia.",
      "diet": "Herbivore - primarily feeds on seeds, fruits, and green vegetation.",
      "fun_facts": [
        "Emus can run at speeds of up to 30 mph and can maintain a steady pace for long distances.",
        "They are known for their distinctive booming calls, used for communication.",
        "Emus have very few natural predators, thanks to their size and speed."
      ],
      "population": "Estimated 600,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1332968378/photo/emu-in-the-rain.webp?a=1&b=1&s=612x612&w=0&k=20&c=VD_plTdRlqXtIUDjfuVFM7FBKYY2LATpSJqTuQFbzMc="
    },
    {
      "id": "45",
      "likes": 1270,
      "name": "Parrot",
      "scientific_name": "Psittaciformes",
      "category": "bird",
      "description": "Parrots are colorful, intelligent birds known for their vibrant plumage and ability to mimic sounds, including human speech. They are highly social animals, often living in flocks and exhibiting complex behaviors. Parrots have strong beaks used to crack open seeds and nuts.",
      "habitat": "Tropical and subtropical regions worldwide.",
      "diet": "Herbivore - primarily feeds on seeds, fruits, nuts, and flowers.",
      "fun_facts": [
        "Some parrot species can live for over 50 years in captivity.",
        "Parrots are known for their playful behavior and problem-solving skills.",
        "They have a highly developed vocal system that allows them to imitate sounds with accuracy."
      ],
      "population": "Population varies widely among species; several species are endangered.",
      "image_url": "https://media.istockphoto.com/id/2096624397/photo/scarlet-macaw.webp?a=1&b=1&s=612x612&w=0&k=20&c=1lH_jrtcST_rLjEjSehSZlM6p70IIArPfQaRxbffjmE="
    },
    {
      "id": "46",
      "likes": 1470,
      "name": "Macaw",
      "scientific_name": "Ara ararauna",
      "category": "bird",
      "description": "Macaws are large, colorful parrots native to Central and South America. Recognized for their bright plumage and long tails, they are highly social birds that often live in large flocks. Macaws have strong beaks that allow them to crack open tough nuts and seeds.",
      "habitat": "Tropical rainforests and savannas.",
      "diet": "Herbivore - primarily feeds on nuts, seeds, fruits, and flowers.",
      "fun_facts": [
        "Macaws can live for over 60 years in captivity.",
        "They are known for their intelligence and playful nature.",
        "Macaws often engage in mutual grooming, strengthening social bonds."
      ],
      "population": "Estimated 50,000 in the wild for blue-and-yellow macaws.",
      "image_url": "https://media.istockphoto.com/id/1873605186/photo/a-scarlet-macaw-bird.webp?a=1&b=1&s=612x612&w=0&k=20&c=PJAVMHFrTxf-4XWJVOQdP5Zl--7khRSFfFkcdJFI8J8="
    },
    {
      "id": "47",
      "likes": 1370,
      "name": "Emperor Penguin",
      "scientific_name": "Aptenodytes forsteri",
      "category": "bird",
      "description": "Emperor penguins are the largest species of penguin, well-known for their impressive size and distinct black and yellow markings. They are unique among birds for their breeding behavior, where the males incubate the eggs on their feet beneath a flap of skin. Emperor penguins are excellent swimmers, hunting for fish and krill under the ice.",
      "habitat": "Antarctic ice and surrounding waters.",
      "diet": "Carnivore - primarily feeds on fish, krill, and squid.",
      "fun_facts": [
        "Emperor penguins can dive to depths of over 1,800 feet and can hold their breath for up to 20 minutes.",
        "They breed during the harsh Antarctic winter, with males going without food for months while incubating eggs.",
        "Emperor penguins can huddle together in large groups to conserve warmth in freezing temperatures."
      ],
      "population": "Estimated 600,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/2168588460/photo/emperor-penguin.webp?a=1&b=1&s=612x612&w=0&k=20&c=SQz2MBegXuvNC2dBdGN3Z7B90uPNlDflQqezRvepTXU="
    },
    {
      "id": "48",
      "likes": 1570,
      "name": "Hummingbird",
      "scientific_name": "Trochilidae",
      "category": "bird",
      "description": "Hummingbirds are small, colorful birds known for their ability to hover in mid-air thanks to their rapid wing flapping. They are unique among birds for their iridescent feathers and are vital pollinators. Hummingbirds primarily feed on nectar but also consume small insects.",
      "habitat": "Gardens, forests, and open areas across the Americas.",
      "diet": "Herbivore - primarily feeds on nectar, supplemented with insects.",
      "fun_facts": [
        "Hummingbirds can flap their wings up to 80 times per second.",
        "They can fly forwards, backwards, and even upside down.",
        "Some species migrate over 3,000 miles each year between breeding and wintering grounds."
      ],
      "population": "Estimates vary; many species are common with local populations in the millions.",
      "image_url": "https://media.istockphoto.com/id/2045878579/photo/white-necked-jacobin-hummingbird-at-a-red-and-yellow-flower-in-a-garden.webp?a=1&b=1&s=612x612&w=0&k=20&c=6OhDwlLi4V_IPBcnKOSao9GfVNqoWMarbiZ4CdBX5RQ="
    },
    {
      "id": "49",
      "likes": 1470,
      "name": "Albatross",
      "scientific_name": "Diomedeidae",
      "category": "bird",
      "description": "Albatrosses are large seabirds known for their long wingspans, which can reach up to 12 feet. They are highly skilled flyers, capable of gliding over vast distances without flapping their wings. Albatrosses primarily feed on fish and squid, using their keen eyesight to locate prey from the air.",
      "habitat": "Open ocean, particularly in the Southern Hemisphere.",
      "diet": "Carnivore - primarily feeds on fish, squid, and carrion.",
      "fun_facts": [
        "Albatrosses can travel over 10,000 miles in a single trip while searching for food.",
        "They have a unique courtship ritual that involves elaborate flying displays.",
        "Some species can live for more than 50 years."
      ],
      "population": "Population varies; some species are endangered.",
      "image_url": "https://media.istockphoto.com/id/2160762539/photo/black-browed-albatross.webp?a=1&b=1&s=612x612&w=0&k=20&c=w0xzqtQqECrKlr6pFOZZbPlZF_ij1QIO3il647QUEMY="
    },
    {
      "id": "50",
      "likes": 970,
      "name": "Pelican",
      "scientific_name": "Pelecanus",
      "category": "bird",
      "description": "Pelicans are large water birds known for their distinctive long bills and large throat pouches, which they use to catch fish. They are often seen near coastlines, estuaries, and lakes. Pelicans are social birds that can often be seen in groups, diving simultaneously while fishing.",
      "habitat": "Coastal regions, lakes, and rivers worldwide.",
      "diet": "Carnivore - primarily feeds on fish.",
      "fun_facts": [
        "Pelicans can hold large amounts of water in their pouches while fishing.",
        "They use cooperative hunting tactics to catch fish by forming a line.",
        "Pelicans can dive from heights of up to 10 feet to catch fish."
      ],
      "population": "Estimated several hundred thousand to over a million worldwide, depending on the species.",
      "image_url": "https://media.istockphoto.com/id/1968486198/photo/pink-backed-pelican-in-senegal.webp?a=1&b=1&s=612x612&w=0&k=20&c=rpOJVKOyoHZgMR1SvaTbCHsbm6_DrsYVLcdz8tY07_A="
    },
    {
      "id": "51",
      "likes": 2870,
      "name": "Swan",
      "scientific_name": "Cygnus",
      "category": "bird",
      "description": "Swans are large waterfowl known for their graceful movements and beautiful plumage. They are often seen gliding on lakes and rivers, and are strong swimmers. Swans are known for their elaborate courtship displays, which often involve synchronized swimming and vocalizations.",
      "habitat": "Lakes, rivers, and wetlands worldwide.",
      "diet": "Herbivore - primarily feeds on aquatic plants, grasses, and grains.",
      "fun_facts": [
        "Swans can live for over 20 years in the wild.",
        "They are known to form monogamous pairs that mate for life.",
        "Swans' wings can produce a loud noise when in flight, often referred to as a 'whoosh.'"
      ],
      "population": "Estimated several hundred thousand worldwide, depending on the species.",
      "image_url": "https://media.istockphoto.com/id/1990636488/photo/swan-portrait-at-golden-hour.webp?a=1&b=1&s=612x612&w=0&k=20&c=7Hxs0kktX-VGT1srCBwND4svfaJ0tt2l_3-xbhPFnSg="
    },
    {
      "id": "52",
      "likes": 1670,
      "name": "Raven",
      "scientific_name": "Corvus corax",
      "category": "bird",
      "description": "Ravens are highly intelligent birds known for their problem-solving abilities and complex vocalizations. They are large, black birds often associated with mythology and folklore. Ravens are social animals that can be found in pairs or groups, exhibiting playful behaviors.",
      "habitat": "Mountains, forests, and urban areas worldwide.",
      "diet": "Omnivore - feeds on insects, small mammals, and carrion.",
      "fun_facts": [
        "Ravens have been observed using tools and adapting their behavior to acquire food.",
        "They can mimic a variety of sounds, including human voices and other animal calls.",
        "Ravens can live up to 15 years in the wild."
      ],
      "population": "Estimated 1 million worldwide.",
      "image_url": "https://media.istockphoto.com/id/1465474308/photo/a-beautiful-raven-corvus-corax-bird-north-poland-europe.webp?a=1&b=1&s=612x612&w=0&k=20&c=U02-_o7BCPcIr6zdlPnxj7cHG9Uy183nmP5xYKKfIT4="
    },
    {
      "id": "53",
      "likes": 1770,
      "name": "Vulture",
      "scientific_name": "Cathartidae",
      "category": "bird",
      "description": "Vultures are large birds known for their scavenging behavior, primarily feeding on carrion. They play a vital role in ecosystems by helping to clean up dead animals and prevent the spread of disease. Vultures have excellent eyesight and can spot food from great distances.",
      "habitat": "Open spaces, savannas, and mountainous regions worldwide.",
      "diet": "Carnivore - primarily feeds on dead animals and carrion.",
      "fun_facts": [
        "Vultures can soar at heights of up to 15,000 feet while searching for food.",
        "They have strong stomach acids that allow them to safely digest decaying meat.",
        "Vultures often gather in large groups at feeding sites."
      ],
      "population": "Population varies; some species are endangered due to habitat loss and poisoning.",
      "image_url": "https://media.istockphoto.com/id/172770614/photo/griffon-vulture.webp?a=1&b=1&s=612x612&w=0&k=20&c=G5oe589Z_-FVodyto7WUHChP7CyKMIED5kYUGDTD12E="
    },
    {
      "id": "54",
      "likes": 1570,
      "name": "Woodpecker",
      "scientific_name": "Picidae",
      "category": "bird",
      "description": "Woodpeckers are easily recognized by their strong beaks and distinctive drumming sounds. They are known for their ability to peck at tree trunks to find insects, develop nesting sites, and create territories. Woodpeckers have specialized feet and tails that aid in climbing trees.",
      "habitat": "Forests, woodlands, and urban areas worldwide.",
      "diet": "Insectivore - primarily feeds on insects, larvae, and sap.",
      "fun_facts": [
        "Woodpeckers can peck on trees at a rate of up to 20 times per second.",
        "They have shock-absorbing anatomy to prevent brain injury from pecking.",
        "Some species use their drumming as a form of communication to attract mates."
      ],
      "population": "Estimated several million worldwide, varies by species.",
      "image_url": "https://media.istockphoto.com/id/1484669652/photo/pileated-woodpecker-portrait.webp?a=1&b=1&s=612x612&w=0&k=20&c=WYgDh_FFQ8ftLmwyC9e5UMosNIEXoCkft2OFZ-awbFg="
    },
    {
      "id": "55",
      "likes": 1470,
      "name": "Crane",
      "scientific_name": "Gruidae",
      "category": "bird",
      "description": "Cranes are large, long-legged birds known for their graceful movements and elaborate courtship dances. They inhabit a variety of habitats, including wetlands and grasslands. Cranes are social birds that often form strong pair bonds and migrate long distances between breeding and wintering grounds.",
      "habitat": "Wetlands, grasslands, and open fields worldwide.",
      "diet": "Omnivore - feeds on seeds, grains, insects, and small animals.",
      "fun_facts": [
        "Cranes are known for their intricate courtship rituals that involve dancing and calling.",
        "They can fly at altitudes of up to 15,000 feet during migration.",
        "Cranes are known to live for over 20 years in the wild."
      ],
      "population": "Estimated several hundred thousand worldwide; varies by species.",
      "image_url": "https://media.istockphoto.com/id/1038126912/photo/crane.webp?a=1&b=1&s=612x612&w=0&k=20&c=glc1jav4n2VHKLKxK1SAfiD6Itat_ZiZSnNQUFBV1O0="
    },
    {
      "id": "56",
      "likes": 1670,
      "name": "Stork",
      "scientific_name": "Ciconiidae",
      "category": "bird",
      "description": "Storks are large, long-legged wading birds known for their impressive wingspans and graceful flight. Often associated with traditional folklore regarding delivering babies, they inhabit wetlands and marshes. Storks primarily feed on fish, amphibians, and small mammals.",
      "habitat": "Wetlands, marshes, and coastal areas worldwide.",
      "diet": "Carnivore - primarily feeds on fish and small animals.",
      "fun_facts": [
        "Storks can migrate long distances, traveling thousands of miles between breeding and wintering grounds.",
        "They build large nests that can be reused for many years.",
        "Storks are known for their impressive aerial displays during courtship."
      ],
      "population": "Estimated several hundred thousand worldwide; varies by species.",
      "image_url": "https://media.istockphoto.com/id/1360852198/photo/stork-stands-in-the-nest-close-up-on-a-blue-background.webp?a=1&b=1&s=612x612&w=0&k=20&c=fGUnrxG3PYBxn3RD4lmJ5iulV_LT3JTnZ56kzMoKx9g="
    },
    {
      "id": "57",
      "likes": 1750,
      "name": "Cockatoo",
      "scientific_name": "Cacatuidae",
      "category": "bird",
      "description": "Cockatoos are striking birds characterized by their colorful plumage and unique crests. They are highly social and intelligent animals, often kept as pets for their strong bond with humans. Cockatoos require mental stimulation and social interaction due to their intelligence.",
      "habitat": "Tropical and subtropical forests in Australia and nearby islands.",
      "diet": "Herbivore - primarily feeds on seeds, nuts, fruits, and flowers.",
      "fun_facts": [
        "Cockatoos are known for their ability to mimic sounds and human speech.",
        "Some species can live for over 60 years in captivity.",
        "They often form strong social bonds with their owners and can be very affectionate."
      ],
      "population": "Population varies; some species are endangered due to habitat loss.",
      "image_url": "https://media.istockphoto.com/id/1398717957/photo/sulphur-crested-cockatoo.webp?a=1&b=1&s=612x612&w=0&k=20&c=S0OMaGPCO5z2UN9VTQGfFB0XdIieb0jka3Xz0TYCwk4="
    },
    {
      "id": "58",
      "likes": 600,
      "name": "King Cobra",
      "scientific_name": "Ophiophagus hannah",
      "category": "reptile",
      "description": "King cobras are the longest venomous snakes in the world, known for their distinctive hood and powerful neurotoxic venom. They primarily prey on other snakes, including other cobras. King cobras are highly territorial and can be aggressive when threatened.",
      "habitat": "Forests and grasslands in Southeast Asia.",
      "diet": "Carnivore - primarily feeds on other snakes.",
      "fun_facts": [
        "King cobras can reach lengths of up to 18 feet.",
        "They have a unique ability to raise the front part of their body off the ground and spread their hood.",
        "King cobras can deliver enough venom in a single bite to kill an elephant."
      ],
      "population": "Estimated several million in the wild.",
      "image_url": "https://media.istockphoto.com/id/538052908/photo/king-cobra.webp?a=1&b=1&s=612x612&w=0&k=20&c=wa17tUgbKEJNvBaRncTq1XlX0jB9YxZCvpqAj8g9Kew="
    },
    {
      "id": "59",
      "likes": 570,
      "name": "Reticulated Python",
      "scientific_name": "Malayopython reticulatus",
      "category": "reptile",
      "description": "Reticulated pythons are one of the longest snake species in the world, known for their intricately patterned scales. They are non-venomous constrictors, subduing prey by wrapping around it tightly. Reticulated pythons can be found in various habitats, including rainforests, swamps, and grasslands.",
      "habitat": "Tropical forests, swamps, and grasslands in Southeast Asia.",
      "diet": "Carnivore - primarily feeds on mammals and birds.",
      "fun_facts": [
        "Reticulated pythons can reach lengths of up to 30 feet or more.",
        "They are excellent swimmers and can hunt in both water and land environments.",
        "Reticulated pythons are known for their extreme flexibility and strength."
      ],
      "population": "Estimated several million in the wild.",
      "image_url": "https://media.istockphoto.com/id/487506120/photo/reticulated-python.webp?a=1&b=1&s=612x612&w=0&k=20&c=SuLmWsP7ZnlgGNyiKvofG0k-RcTqu2aSDkwkqDaDVQo="
    },
    {
      "id": "60",
      "likes": 770,
      "name": "Nile Crocodile",
      "scientific_name": "Crocodylus niloticus",
      "category": "reptile",
      "description": "The Nile crocodile is a large and powerful reptile, known for its strong jaws and aggressive behavior. They are opportunistic hunters found in freshwater habitats such as rivers, lakes, and marshes. Nile crocodiles have an impressive size, with adults reaching 16 to 20 feet in length.",
      "habitat": "Freshwater rivers, lakes, and marshes across Africa.",
      "diet": "Carnivore - primarily feeds on fish, birds, and mammals.",
      "fun_facts": [
        "Nile crocodiles can remain submerged for hours while waiting for prey.",
        "They can exert a bite force of over 1,500 psi, among the strongest of any animal.",
        "Nile crocodiles are known to be excellent swimmers and can move quickly in the water."
      ],
      "population": "Estimated over 200,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1578486838/photo/group-of-crocodiles-coming-out-of-the-water-to-eat-crocodiles-get-ready-to-attack-prey-group.webp?a=1&b=1&s=612x612&w=0&k=20&c=tKTHjnMJ58IftgLQDmlmgBcta0jNdlcB7BKRRdGCOZI="
    },
    {
      "id": "61",
      "likes": 970,
      "name": "Alligator",
      "scientific_name": "Alligator mississippiensis",
      "category": "reptile",
      "description": "Alligators are large reptiles native to the wetlands of North America. They have a broad snout, powerful tail, and strong jaws, making them skilled predators. Alligators are more tolerant of cold than their crocodilian relatives and can often be found basking in the sun.",
      "habitat": "Freshwater swamps, marshes, and rivers in the southeastern United States and China.",
      "diet": "Carnivore - primarily feeds on fish, birds, and small mammals.",
      "fun_facts": [
        "Alligators can hold their breath underwater for over an hour.",
        "They have a unique mating call that can be heard from great distances.",
        "Alligator skulls are lightweight, making them buoyant for swimming."
      ],
      "population": "Estimated 1 million in the wild.",
      "image_url": "https://media.istockphoto.com/id/174673392/photo/alligator-smiley.webp?a=1&b=1&s=612x612&w=0&k=20&c=M3r0WnpxQw0QKCSZY9peeLq1ql0ipurzlpJR0Tfr-BQ="
    },
    {
      "id": "62",
      "likes": 470,
      "name": "Chameleon",
      "scientific_name": "Chamaeleonidae",
      "category": "reptile",
      "description": "Chameleons are distinctive reptiles known for their ability to change color, a feature used for communication and camouflage. They have zygodactylous feet, allowing them to grip branches easily, and long, sticky tongues for capturing insects. Chameleons are primarily arboreal and require specific environmental conditions to thrive.",
      "habitat": "Tropical forests and shrublands in Africa, Madagascar, and parts of Asia.",
      "diet": "Carnivore - primarily feeds on insects.",
      "fun_facts": [
        "Chameleons can change color in response to their mood, temperature, and light.",
        "They have excellent vision, with eyes that can move independently of each other.",
        "Chameleons use their long tongues to catch prey with great precision."
      ],
      "population": "Population varies by species; many are threatened due to habitat loss.",
      "image_url": "https://media.istockphoto.com/id/969103888/photo/chameleon.webp?a=1&b=1&s=612x612&w=0&k=20&c=5o-KZo05khv9kd3W1NrZpWLGseCXkCYEDjy91GDQ3ag="
    },
    {
      "id": "63",
      "likes": 730,
      "name": "Gecko",
      "scientific_name": "Gekkonidae",
      "category": "reptile",
      "description": "Geckos are small to medium-sized lizards known for their distinctive vocalizations and adhesive toe pads, which allow them to climb smooth surfaces easily. They exhibit a wide range of colors and patterns and are able to thrive in diverse habitats, from deserts to rainforests.",
      "habitat": "Tropical to temperate regions, including forests, deserts, and urban areas.",
      "diet": "Insectivore - primarily feeds on insects and small invertebrates.",
      "fun_facts": [
        "Geckos can make a variety of sounds, including chirps and barks, to communicate.",
        "Some gecko species can grow their tails back after losing them, a trait known as autotomy.",
        "Geckos are nocturnal and have excellent night vision, aiding in their predation."
      ],
      "population": "Estimated several million globally; varies by species.",
      "image_url": "https://media.istockphoto.com/id/2157491920/photo/endemic-mauritius-ornate-day-gecko-standing-upside-down-on-leaf-of-palm-tree.webp?a=1&b=1&s=612x612&w=0&k=20&c=Via04YL7IxtSr55KSBgtvUkl3RYnDc307d_BztX4ZIs="
    },
    {
      "id": "64",
      "likes": 730,
      "name": "Galpagos Tortoise",
      "scientific_name": "Chelonoidis nigra",
      "category": "reptile",
      "description": "Galpagos tortoises are the largest tortoise species in the world, known for their longevity and unique shell shape. They play a vital role in the ecosystems of the Galpagos Islands by dispersing seeds and creating paths through dense vegetation. These tortoises are known for their slow movement and need for specific environmental conditions.",
      "habitat": "Galpagos Islands, inhabiting a variety of habitats from dry grasslands to lush highlands.",
      "diet": "Herbivore - primarily feeds on grasses, leaves, and fruits.",
      "fun_facts": [
        "Galpagos tortoises can live for over 100 years.",
        "They use their large size to store water for long periods during drought.",
        "Each tortoise has a unique shell shape that provides insight into their habitat."
      ],
      "population": "Estimated 20,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/2005665994/photo/galapgos-earth-tortoise-turtle.webp?a=1&b=1&s=612x612&w=0&k=20&c=fCOihpzwmZzBEhnm8Tig4TqP_CjZRNoO6dbIj8z0bqE="
    },
    {
      "id": "65",
      "likes": 2260,
      "name": "Green Sea Turtle",
      "scientific_name": "Chelonia mydas",
      "category": "reptile",
      "description": "Green sea turtles are large marine reptiles known for their beautiful shells and distinct greenish color, which comes from their diet of seagrass. They are migratory animals, often traveling long distances between feeding and breeding grounds. Green sea turtles play a vital role in maintaining healthy seagrass ecosystems.",
      "habitat": "Coastal and oceanic regions worldwide, often found in shallow waters.",
      "diet": "Herbivore - primarily feeds on seagrass and algae.",
      "fun_facts": [
        "Green sea turtles can hold their breath for up to five hours while submerged.",
        "They are the only species of sea turtle that is primarily herbivorous.",
        "Green sea turtles can weigh up to 350 pounds and are known to nest on sandy beaches."
      ],
      "population": "Estimated 200,000 breeding females globally.",
      "image_url": "https://media.istockphoto.com/id/1938498790/photo/green-turtle.webp?a=1&b=1&s=612x612&w=0&k=20&c=GZ-gVV866zvcSRm5xdTlk9h84StYwxkOmT0A1exT6yI="
    },
    {
      "id": "66",
      "likes": 870,
      "name": "Iguana",
      "scientific_name": "Iguanidae",
      "category": "reptile",
      "description": "Iguanas are large, herbivorous lizards often found in tropical and subtropical regions. They are recognized by their distinctive crests of spines along their backs and long tails. Iguanas are excellent climbers, spending much of their time in trees, and are generally solitary in nature.",
      "habitat": "Trees and shrubs in tropical forests and dry regions.",
      "diet": "Herbivore - primarily feeds on leaves, flowers, and fruits.",
      "fun_facts": [
        "Iguanas can detach their tails as a defense mechanism, allowing them to escape predators.",
        "They are known for their ability to change color based on temperature and mood.",
        "Some iguana species are adept swimmers and can dive underwater to escape threats."
      ],
      "population": "Population varies by species; some are threatened due to habitat loss.",
      "image_url": "https://media.istockphoto.com/id/1401966592/photo/iguana-wildlife.webp?a=1&b=1&s=612x612&w=0&k=20&c=lPpto__efl2zX5qIYBKr_llG8BcOcxOBHG8RCl0dwns="
    },
    {
      "id": "67",
      "likes": 970,
      "name": "Monitor Lizard",
      "scientific_name": "Varanidae",
      "category": "reptile",
      "description": "Monitor lizards are large, carnivorous reptiles known for their keen senses and opportunistic feeding behaviors. Found in various habitats, including forests, savannas, and deserts, they have strong limbs and sharp claws, making them efficient hunters. Some monitor lizards can grow to impressive lengths, with some species reaching over 10 feet.",
      "habitat": "Forests, grasslands, and deserts across Africa, Asia, and Australia.",
      "diet": "Carnivore - primarily feeds on small mammals, birds, and eggs.",
      "fun_facts": [
        "Monitor lizards have potent venom that can subdue their prey.",
        "They have a keen sense of smell, aided by their forked tongues.",
        "Some species of monitor lizard are known to engage in complex social behaviors."
      ],
      "population": "Population varies widely; some species can be common while others are endangered.",
      "image_url": "https://media.istockphoto.com/id/2178270630/photo/lace-monitor-goanna.webp?a=1&b=1&s=612x612&w=0&k=20&c=QDY1lhdHJgH4eJ-l4V5RaC1sj2sWbQUr024bjBvq4gk="
    },
    {
      "id": "68",
      "likes": 970,
      "name": "Gila Monster",
      "scientific_name": "Heloderma suspectum",
      "category": "reptile",
      "description": "The Gila monster is one of the few venomous lizard species, recognized for its distinctive black and orange or pink coloration. This lizard is native to the southwestern United States and northwestern Mexico. While Gila monsters are slow-moving, they possess potent venom in their bite, which they use to subdue prey.",
      "habitat": "Deserts and scrublands in the southwestern United States and Mexico.",
      "diet": "Carnivore - primarily feeds on small mammals, birds, and eggs.",
      "fun_facts": [
        "Gila monsters have a powerful bite that can inject venom, used primarily for defense.",
        "They are known to store fat in their bodies, allowing them to survive long periods without food.",
        "Gila monsters are mostly nocturnal and spend time in burrows during the day."
      ],
      "population": "Estimated several thousand in the wild.",
      "image_url": "https://media.istockphoto.com/id/1766098608/photo/the-gila-monster-heloderma-suspectum-is-a-species-of-venomous-lizard-native-to-the.webp?a=1&b=1&s=612x612&w=0&k=20&c=zTxFKlR-0UtabUrjG4Q04XDE_47tnRlcWFgCQTc5F4U="
    },
    {
      "id": "69",
      "likes": 730,
      "name": "Rattlesnake",
      "scientific_name": "Crotalus",
      "category": "reptile",
      "description": "Rattlesnakes are venomous snakes known for the distinctive rattle on their tails, which they use as a warning signal to potential threats. Found predominantly in the Americas, these snakes have heat-sensing pits that help them locate prey, usually small mammals and birds.",
      "habitat": "Deserts, grasslands, and forests across the Americas.",
      "diet": "Carnivore - primarily feeds on small mammals, birds, and reptiles.",
      "fun_facts": [
        "Rattlesnakes can detect infrared radiation from warm-blooded prey, aiding in hunting.",
        "Their venom is composed of enzymes and proteins used to immobilize prey.",
        "Rattlesnake populations can be found in a variety of habitats, adapting to their environments."
      ],
      "population": "Estimated several million in the wild.",
      "image_url": "https://media.istockphoto.com/id/1207806058/photo/desert-phase-black-tailed-rattlesnake.webp?a=1&b=1&s=612x612&w=0&k=20&c=Zci6KNJ0jr2Jmvrf66rs3E7iirQdPMMpKdlt7bN9hlE="
    },
    {
      "id": "70",
      "likes": 1069,
      "name": "Great White Shark",
      "scientific_name": "Carcharodon carcharias",
      "category": "fish",
      "description": "Great white sharks are one of the most well-known predatory fish in the ocean, recognized for their size, strength, and intimidating presence. They are apex predators, primarily preying on marine mammals, fish, and seabirds. Great whites have a keen sense of smell and can detect blood in the water from miles away.",
      "habitat": "Coastal and offshore waters in temperate and tropical regions.",
      "diet": "Carnivore - primarily feeds on seals, fish, and other marine mammals.",
      "fun_facts": [
        "Great white sharks can swim at speeds of up to 25 mph.",
        "They can grow up to 20 feet long and weigh over 5,000 pounds.",
        "Great whites are known for breaching the surface when attacking prey."
      ],
      "population": "Estimated 3,500 in the wild.",
      "image_url": "https://media.istockphoto.com/id/533130811/photo/great-white-shark-smile.webp?a=1&b=1&s=612x612&w=0&k=20&c=LaSNlOaR7ATgGh6HVAhOB9rbHE0iWR6z1PJV5ErwYN4="
    },
    {
      "id": "71",
      "likes": 871,
      "name": "Hammerhead Shark",
      "scientific_name": "Sphyrna",
      "category": "fish",
      "description": "Hammerhead sharks are easily recognized by their unique head shape, which helps them have a better visual range and enhances their ability to locate prey. They are found in warm waters and are known for their social behavior, often swimming in schools. Hammerheads primarily feed on fish, including stingrays and other small sharks.",
      "habitat": "Coastal areas, especially near the continental shelf.",
      "diet": "Carnivore - primarily feeds on fish and cephalopods.",
      "fun_facts": [
        "Hammerhead sharks can swim in schools of up to 100 individuals.",
        "Their wide-set eyes provide them with a 360-degree view of their surroundings.",
        "They can grow up to 20 feet long, depending on the species."
      ],
      "population": "Population varies by species; some are threatened due to overfishing.",
      "image_url": "https://media.istockphoto.com/id/543687748/photo/hammerhead-shark-on-the-ocean-floor.webp?a=1&b=1&s=612x612&w=0&k=20&c=C75Wpx8MTBAVXgGTCawJv1MCURujUrVhwayZAuLqPDA="
    },
    {
      "id": "72",
      "likes": 1962,
      "name": "Clownfish",
      "scientific_name": "Amphiprioninae",
      "category": "fish",
      "description": "Clownfish, also known as anemonefish, are small, brightly colored coral reef fish famous for their symbiotic relationship with sea anemones. They are primarily orange with white stripes and have a unique ability to withstand the anemone's sting. Clownfish are highly territorial and known for their social behavior.",
      "habitat": "Coral reefs in the warm seas of the Pacific and Indian Oceans.",
      "diet": "Omnivore - feeds on algae, zooplankton, and small invertebrates.",
      "fun_facts": [
        "Clownfish can change sex; if the dominant female dies, the dominant male will change into a female.",
        "They have a mutualistic relationship with sea anemones, providing protection from predators.",
        "Clownfish are known for their vibrant colors and distinctive patterns."
      ],
      "population": "Population varies; many species are common, but some are threatened.",
      "image_url": "https://media.istockphoto.com/id/1212886661/photo/clownfish.webp?a=1&b=1&s=612x612&w=0&k=20&c=Nkleomhz3lPERuOaLjM5sTzCLAE0QbbAE84THDe7EJU="
    },
    {
      "id": "73",
      "likes": 1170,
      "name": "Anglerfish",
      "scientific_name": "Lophiiformes",
      "category": "fish",
      "description": "Anglerfish are deep-sea fish known for their unique method of predation, using a bioluminescent lure to attract prey. They have large mouths filled with sharp teeth, allowing them to consume prey larger than themselves. Anglerfish exhibit dimorphism, where females are significantly larger than males.",
      "habitat": "Deep sea environments, particularly in dark oceanic waters.",
      "diet": "Carnivore - feeds primarily on fish and other small marine creatures.",
      "fun_facts": [
        "The lure of an anglerfish is a modified dorsal fin that emits light to attract prey.",
        "Some species can expand their stomachs to accommodate large prey.",
        "Male anglerfish are much smaller than females and often attach to them for life."
      ],
      "population": "Population varies; generally hard to assess due to deep-sea habitat.",
      "image_url": "https://media.istockphoto.com/id/1701811448/photo/dark-deep-sea-fish.webp?a=1&b=1&s=612x612&w=0&k=20&c=ctkDD9LaBeyKH_3yAIpPN218K2PAKehi7FO62JaZR24="
    },
    {
      "id": "74",
      "likes": 1970,
      "name": "Lionfish",
      "scientific_name": "Pterois",
      "category": "fish",
      "description": "Lionfish are venomous marine fish known for their striking appearance and long, spiky fins. They are native to the Indo-Pacific region but have become an invasive species in the Atlantic Ocean. Lionfish are skilled hunters and feed on small fish and invertebrates.",
      "habitat": "Coral reefs and rocky habitats in warm waters.",
      "diet": "Carnivore - primarily feeds on small fish and crustaceans.",
      "fun_facts": [
        "Lionfish have venomous spines that can deliver painful stings to predators and humans.",
        "They have few natural predators in the Atlantic, leading to population explosions.",
        "Lionfish can consume prey up to half their body size."
      ],
      "population": "Population varies by region; invasive in the Atlantic but native in the Indo-Pacific.",
      "image_url": "https://media.istockphoto.com/id/1787985622/photo/beautiful-lionfish-or-zebra-fish.webp?a=1&b=1&s=612x612&w=0&k=20&c=AcrSidyuFQe66wGajhjSJEyazJyoZkILdZkhNo2AjHA="
    },
    {
      "id": "75",
      "likes": 2070,
      "name": "Goldfish",
      "scientific_name": "Carassius auratus",
      "category": "fish",
      "description": "Goldfish are small, domesticated fish known for their bright orange color and playful nature. They are one of the most popular aquarium fish and have been bred for various colors and shapes. Goldfish are social creatures that thrive in groups and need proper care to live healthy lives.",
      "habitat": "Freshwater habitats, often kept in tanks and ponds.",
      "diet": "Omnivore - primarily feeds on algae, plant matter, and small invertebrates.",
      "fun_facts": [
        "Goldfish have a memory span of several months, contrary to the myth of a three-second memory.",
        "They can live for over 10 years in captivity, with some individuals reaching 20 years.",
        "Goldfish come in many varieties, including fancy goldfish like the bubble-eye and lionhead."
      ],
      "population": "Highly populated in domestic environments; millions kept as pets.",
      "image_url": "https://media.istockphoto.com/id/168627134/photo/goldfish-aquarium-a-fish-on-the-background-of-aquatic-plants.webp?a=1&b=1&s=612x612&w=0&k=20&c=7NStWPiHv-xlVIce_6mUSCFjltnyOZc8O-vD5rXdkhM="
    },
    {
      "id": "76",
      "likes": 1270,
      "name": "Stingray",
      "scientific_name": "Dasyatidae",
      "category": "fish",
      "description": "Stingrays are flat-bodied bottom-dwelling fish known for their smooth, rounded bodies and long, whip-like tails. Many species have venomous stingers, used as a defense mechanism against predators. Stingrays are found in coastal waters and can often be seen gliding gracefully along the ocean floor.",
      "habitat": "Shallow coastal waters and sandy bottoms.",
      "diet": "Carnivore - primarily feeds on mollusks, crustaceans, and small fish.",
      "fun_facts": [
        "Some species can leap out of the water, gliding through the air for short distances.",
        "Stingrays can bury themselves in sand to hide from predators and ambush prey.",
        "Their flat bodies are adapted for life on the ocean floor."
      ],
      "population": "Population varies by species; some are threatened due to habitat loss.",
      "image_url": "https://media.istockphoto.com/id/157732523/photo/spotted-stingray-fish.webp?a=1&b=1&s=612x612&w=0&k=20&c=yU2M1vuUXDTHFUR5-8tHi20-LyYe4CAG8wFKVuiIxmg="
    },
    {
      "id": "77",
      "likes": 870,
      "name": "Catfish",
      "scientific_name": "Siluriformes",
      "category": "fish",
      "description": "Catfish are a diverse group of freshwater fish known for their whisker-like barbels, which they use to sense their environment. They are bottom feeders and vary greatly in size and habitat preference. Catfish are highly adaptable and can thrive in many different water conditions.",
      "habitat": "Freshwater rivers, lakes, and ponds worldwide.",
      "diet": "Omnivore - feeds on detritus, small fish, and plant matter.",
      "fun_facts": [
        "Some catfish can grow to be very large; the Mekong giant catfish can reach over 9 feet long.",
        "Catfish have excellent taste buds and can taste in all areas of their bodies.",
        "Some species can produce electric shocks as a form of defense."
      ],
      "population": "Population varies widely based on species; many are common.",
      "image_url": "https://media.istockphoto.com/id/2158350852/photo/a-brown-bullhead-is-a-catfish.webp?a=1&b=1&s=612x612&w=0&k=20&c=Shh-HzhNX4tFmYrpPji4EyeoXxl0MlWKY7gkI4-ylOI="
    },
    {
      "id": "78",
      "likes": 670,
      "name": "Tuna",
      "scientific_name": "Thunnus",
      "category": "fish",
      "description": "Tuna are large, fast-swimming marine fish known for their sleek bodies and high value in the fishing industry. They are among the fastest fish in the ocean, capable of swimming at speeds up to 75 mph. Tuna are highly migratory and are often found in warm oceanic waters.",
      "habitat": "Open ocean, particularly in warm and temperate waters.",
      "diet": "Carnivore - primarily feeds on smaller fish and squid.",
      "fun_facts": [
        "Tuna can maintain a body temperature higher than the surrounding water, aiding in their speed.",
        "They are important both ecologically and economically, as they are a staple in many cultures' diets.",
        "Some species of tuna can weigh over 1,000 pounds."
      ],
      "population": "Population varies by species; some are at risk due to overfishing.",
      "image_url": "https://media.istockphoto.com/id/1334276621/photo/bluefin-tuna-thunnus-thynnus-saltwater-fish.webp?a=1&b=1&s=612x612&w=0&k=20&c=TWb4NbpXdMFEkZ23PWTDhmZpEhwmIb4sYeTwG-_AwBs="
    },
    {
      "id": "79",
      "likes": 970,
      "name": "Pufferfish",
      "scientific_name": "Tetraodontidae",
      "category": "fish",
      "description": "Pufferfish are unique marine fish known for their ability to inflate their bodies as a defense mechanism. They are often brightly colored and can contain toxins, making them unpalatable to predators. Pufferfish are typically found in warm oceanic waters and coral reefs.",
      "habitat": "Coral reefs, lagoons, and open ocean.",
      "diet": "Carnivore - primarily feeds on invertebrates and algae.",
      "fun_facts": [
        "Pufferfish contain a potent toxin called tetrodotoxin, which is lethal to predators and humans.",
        "They can expand their bodies to several times their normal size to deter attackers.",
        "Some species are considered delicacies in certain cultures, despite the risk of poisoning."
      ],
      "population": "Population varies by species; most are common in their habitats.",
      "image_url": "https://media.istockphoto.com/id/2153195658/photo/yellowspotted-burrfish-using-its-defense-system.webp?a=1&b=1&s=612x612&w=0&k=20&c=mwUftaoXXPn9hTYuurYDCajfi3B8HfHUYm1zot6u048="
    },
    {
      "id": "80",
      "likes": 1570,
      "name": "Seal",
      "scientific_name": "Phocidae",
      "category": "mammal",
      "description": "Seals are marine mammals known for their streamlined bodies and ability to navigate both land and water. They are often found on rocky shores and ice and are known for their playful behavior in the water. Seals primarily feed on fish and squid.",
      "habitat": "Oceans and coastal areas worldwide, often near ice or rocky shores.",
      "diet": "Carnivore - primarily feeds on fish and squid.",
      "fun_facts": [
        "Seals can hold their breath for up to 30 minutes while diving for food.",
        "They have excellent hearing and can locate prey using sound.",
        "Some species, like the elephant seal, can weigh over two tons."
      ],
      "population": "Population varies widely by species; some are common, while others are endangered.",
      "image_url": "https://media.istockphoto.com/id/496793764/photo/harbor-seal.webp?a=1&b=1&s=612x612&w=0&k=20&c=c3gMd4Jzac4yHlxFyqUA_ADze-elkNPyvGrnumsf0O4="
    },
    {
      "id": "81",
      "likes": 870,
      "name": "Walrus",
      "scientific_name": "Odobenus rosmarus",
      "category": "mammal",
      "description": "Walruses are large marine mammals known for their characteristic tusks, whiskers, and blubbery bodies. They often inhabit cold Arctic waters and are social animals, found in groups known as herds. Walruses primarily feed on benthic organisms, including clams and mollusks.",
      "habitat": "Arctic and subarctic waters, often resting on sea ice or beaches.",
      "diet": "Carnivore - primarily feeds on clams, mollusks, and other invertebrates.",
      "fun_facts": [
        "Walrus tusks are elongated canines used for social interactions and defense.",
        "They can hold their breath underwater for up to 30 minutes while hunting.",
        "Walruses are known to be highly social animals, often seen in large groups."
      ],
      "population": "Estimated 200,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/507243873/photo/waltus.webp?a=1&b=1&s=612x612&w=0&k=20&c=ulQAGvIbSEJrEjazSKfm4jaLa7pT-0J_yF6sP8y82mY="
    },
    {
      "id": "82",
      "likes": 870,
      "name": "Manatee",
      "scientific_name": "Trichechus",
      "category": "mammal",
      "description": "Manatees, also known as sea cows, are large marine mammals that inhabit warm coastal waters. They are slow-moving herbivores, primarily feeding on seagrass and aquatic plants. Manatees are known for their gentle nature and are often seen floating leisurely in the water.",
      "habitat": "Coastal waters, rivers, and estuaries in warm regions.",
      "diet": "Herbivore - primarily feeds on seagrass and aquatic vegetation.",
      "fun_facts": [
        "Manatees can weigh up to 1,200 pounds and grow to lengths of 13 feet.",
        "They have a low metabolic rate, which allows them to thrive on a vegetarian diet.",
        "Manatees are known to be great swimmers, capable of moving at speeds of up to 15 mph."
      ],
      "population": "Estimated 13,000 in the wild, primarily in Florida.",
      "image_url": "https://media.istockphoto.com/id/1360292778/photo/the-west-indian-manatee-or-sea-cow-also-known-as-north-american-manatee-is-the-largest.webp?a=1&b=1&s=612x612&w=0&k=20&c=5JAzorlMqm04AhrN3NbtXNjSZTRhtFAq9zN8Faore-0="
    },
    {
      "id": "83",
      "likes": 770,
      "name": "Narwhal",
      "scientific_name": "Monodon monoceros",
      "category": "mammal",
      "description": "Narwhals are unique marine mammals known for their long, spiral tusks, which can reach lengths of up to 10 feet. They inhabit Arctic waters and are known for their ability to dive deep to hunt for fish and squid. Narwhals are often called the 'unicorns of the sea' due to their distinctive tusks.",
      "habitat": "Arctic waters, particularly in the Canadian Arctic and Greenland.",
      "diet": "Carnivore - primarily feeds on fish, squid, and shrimp.",
      "fun_facts": [
        "Narwhales can dive to depths of over 1,500 meters while hunting.",
        "The tusk is an elongated tooth; both males and females can have a tusk, but males are more commonly seen with it.",
        "Narwhal populations can be affected by climate change, as their habitat is heavily dependent on sea ice."
      ],
      "population": "Estimated 80,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/2166801275/photo/narwhal-male-whales.webp?a=1&b=1&s=612x612&w=0&k=20&c=BFit2x3kgq9avdA11fl4nGzdcToongQqg_ufv5Ae3gw="
    },
    {
      "id": "85",
      "likes": 670,
      "name": "Dugong",
      "scientific_name": "Dugong dugon",
      "category": "mammal",
      "description": "Dugongs are large marine mammals closely related to manatees and known for their herbivorous diets that primarily consist of seagrass. They are slow-moving creatures often found in warm coastal waters. Dugongs have unique paddle-shaped flippers that assist them in swimming through seagrass beds.",
      "habitat": "Coastal waters and shallow lagoons in warm seas.",
      "diet": "Herbivore - primarily feeds on seagrass.",
      "fun_facts": [
        "Dugongs can hold their breath underwater for up to six minutes while foraging for food.",
        "They are often seen grazing in seagrass beds alongside manatees.",
        "Dugongs are known to have long lifespan, living up to 70 years."
      ],
      "population": "Estimated 80,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1729477859/photo/dugong-in-the-red-sea.webp?a=1&b=1&s=612x612&w=0&k=20&c=o2ucGc0kYrPSaZJ5UOvOOsXxN4kMKJ18n6BX0uRopWg="
    },
    {
      "id": "86",
      "likes": 670,
      "name": "Hedgehog",
      "scientific_name": "Erinaceinae",
      "category": "mammal",
      "description": "Hedgehogs are small, nocturnal mammals known for their spiny coat, which provides protection from predators. They are commonly found in gardens and forests, where they forage for insects, snails, and small invertebrates. Hedgehogs can roll into a tight ball when threatened, hiding their vulnerable areas.",
      "habitat": "Woodlands, grasslands, and suburban areas.",
      "diet": "Insectivore - primarily feeds on insects and small invertebrates.",
      "fun_facts": [
        "Hedgehogs can run at speeds of up to 4 mph.",
        "They have a remarkable sense of smell and can find food buried under leaves and soil.",
        "Hedgehogs hibernate during the winter in colder climates."
      ],
      "population": "Estimated several million in the wild:",
      "image_url": "https://media.istockphoto.com/id/2092156381/photo/european-hedgehog.webp?a=1&b=1&s=612x612&w=0&k=20&c=9uI5Uf6_WQc_hoYeOLjSOYKv8U-di8-WltI26jQ34DE="
    },
    {
      "id": "88",
      "likes": 1270,
      "name": "Ferret",
      "scientific_name": "Mustela putorius furo",
      "category": "mammal",
      "description": "Ferrets are small, domesticated mammals belonging to the weasel family. Known for their playful and mischievous behavior, they are social animals often kept as pets. Ferrets are curious and intelligent, requiring mental and physical stimulation.",
      "habitat": "Domesticated; found in homes and farms worldwide.",
      "diet": "Carnivore - primarily feeds on meat, including small animals and eggs.",
      "fun_facts": [
        "Ferrets can sleep up to 18 hours a day but are very active during the remaining hours.",
        "They have a unique odor, which some owners find endearing, while others may consider it strong.",
        "Ferrets are known for their playful nature and ability to play games like hide-and-seek."
      ],
      "population": "Widely bred and kept as pets; estimated several million globally.",
      "image_url": "https://media.istockphoto.com/id/2074175062/photo/two-ferrets-walking-together-on-leash-in-summer-green-grass.webp?a=1&b=1&s=612x612&w=0&k=20&c=iJplqMEQIJwjUVieM9NwIbklgxbKxuY_S6VgEDvzweA="
    },
    {
      "id": "89",
      "likes": 2570,
      "name": "Platypus",
      "scientific_name": "Ornithorhynchus anatinus",
      "category": "mammal",
      "description": "The platypus is an egg-laying mammal native to Australia, known for its unique appearance and combination of features from various animal groups. With a flat bill resembling a duck and webbed feet, it is an adept swimmer. The platypus is one of only five extant species of monotremes, which are egg-laying mammals.",
      "habitat": "Freshwater rivers, lakes, and wetlands in Australia.",
      "diet": "Carnivore - primarily feeds on insects, larvae, and small aquatic animals.",
      "fun_facts": [
        "Platypuses have venomous spurs on their hind legs, used for defense.",
        "They locate prey using electroreception, sensing electric fields generated by movement.",
        "Platypuses are one of the few mammals that lay eggs instead of giving birth to live young."
      ],
      "population": "Estimated 300,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/2152996198/photo/high-angle-shot-of-a-platypus-swimming-to-the-left-in-the-broken-river-at-eungella-national.webp?a=1&b=1&s=612x612&w=0&k=20&c=Q7cDoc0I3hsPMzZmbI3hprwX5i9RMuMbOVtu8Hyd3Sw="
    },
    {
      "id": "90",
      "likes": 1270,
      "name": "Tapir",
      "scientific_name": "Tapiridae",
      "category": "mammal",
      "description": "Tapirs are large, herbivorous mammals native to Central and South America and Southeast Asia. They are characterized by their stout bodies and short snouts, which resemble a combination of a pig and an elephant's trunk. Tapirs are semi-aquatic and are known for their excellent swimming abilities.",
      "habitat": "Forests, grasslands, and wetlands.",
      "diet": "Herbivore - primarily feeds on leaves, fruits, and aquatic plants.",
      "fun_facts": [
        "Tapirs can dive underwater, holding their breath for several minutes.",
        "They are important seed dispersers for many tree species in their habitat.",
        "Tapirs are usually solitary animals, coming together only for mating."
      ],
      "population": "Population varies by species; some are endangered due to habitat loss.",
      "image_url": "https://media.istockphoto.com/id/1365736941/photo/bairds-tapir.webp?a=1&b=1&s=612x612&w=0&k=20&c=dyaRD9cdU_ghuuk58Kq6RWXRshZACfGugL7G6iS54zY="
    },
    {
      "id": "91",
      "likes": 1470,
      "name": "Antelope",
      "scientific_name": "Bovidae",
      "category": "mammal",
      "description": "Antelopes are a diverse group of herbivorous mammals found in various habitats in Africa and Asia. They are known for their speed and agility, which help them escape predators. Antelope species range in size and appearance, with some being solitary while others form large herds.",
      "habitat": "Grasslands, savannas, and forests.",
      "diet": "Herbivore - primarily feeds on grasses and leaves.",
      "fun_facts": [
        "Antelopes are known for their incredible speed, with some species capable of running over 50 mph.",
        "Many antelope species engage in migratory behavior, following food and water sources.",
        "Their social structures vary widely; some live in groups called herds, while others are more solitary."
      ],
      "population": "Population varies widely; many species are common while some are endangered.",
      "image_url": "https://media.istockphoto.com/id/1401261120/photo/a-male-impala-on-an-overcast-morning-on-the-grasslands-of-central-kruger.webp?a=1&b=1&s=612x612&w=0&k=20&c=juJ-dgZed6AojPzVVHik_jDZEbGZpu5R69iNRitblpM="
    },
    {
      "id": "92",
      "likes": 1370,
      "name": "Oryx",
      "scientific_name": "Oryx",
      "category": "mammal",
      "description": "Oryxes are large, antelope-like mammals that inhabit arid regions in Africa and the Middle East. They are known for their long, straight horns and striking appearance. Oryxes are well adapted to their harsh environments and can survive long periods without water.",
      "habitat": "Deserts and dry savannahs.",
      "diet": "Herbivore - primarily feeds on grasses and shrubs.",
      "fun_facts": [
        "Oryxes can survive without water by extracting moisture from the plants they eat.",
        "They are known to be able to withstand extreme temperatures, making them adaptable to arid climates.",
        "Oryxes have excellent eyesight and can detect predators from great distances."
      ],
      "population": "Estimated several thousand for certain species; some are endangered.",
      "image_url": "https://media.istockphoto.com/id/1902089177/photo/gemsboks.webp?a=1&b=1&s=612x612&w=0&k=20&c=SiHF9zk2FFIAZseM8y2BLQBDW2bOJQJhchfuDPpTsto="
    },
    {
      "id": "93",
      "likes": 1150,
      "name": "Kudu",
      "scientific_name": "Tragelaphus strepsiceros",
      "category": "mammal",
      "description": "Kudus are large antelopes known for their impressive spiral horns and striking coloration. They inhabit woodlands and savannas in Africa and are known for their agility and ability to leap over obstacles when fleeing from predators.",
      "habitat": "Woodlands and savanna regions of Africa.",
      "diet": "Herbivore - primarily feeds on leaves, shrubs, and grasses.",
      "fun_facts": [
        "Kudus are known for their stealth and agility, often using their coloration to blend into their surroundings.",
        "They can jump over obstacles up to 8 feet high when escaping predators.",
        "Kudus are generally social animals that prefer to stay in small groups."
      ],
      "population": "Estimated 300,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/2148808079/photo/large-kudu-bull-in-the-kruger-national-park-limpopo-south-africa.webp?a=1&b=1&s=612x612&w=0&k=20&c=RLeTNFbL7vrpuPD8bbNvhPStMuUaJIXQNsWbJP2E0FY="
    },
    {
      "id": "94",
      "likes": 1570,
      "name": "Bongo",
      "scientific_name": "Tragelaphus eurycerus",
      "category": "mammal",
      "description": "Bongos are strikingly patterned antelopes found in the rainforests of Central and West Africa. They are known for their reddish-brown fur with white stripes, which help with camouflage. Bongos are primarily nocturnal and prefer dense cover to avoid predators.",
      "habitat": "Rainforests and thick bush in Central and West Africa.",
      "diet": "Herbivore - primarily feeds on leaves, fruits, and ferns.",
      "fun_facts": [
        "Bongos are excellent climbers and often navigate steep and rugged terrain.",
        "They have large, spiraled horns that can reach lengths of up to 36 inches in males.",
        "Bongos are known to communicate with each other through low-frequency vocalizations."
      ],
      "population": "Estimated 100,000 in the wild; some populations are threatened.",
      "image_url": "https://media.istockphoto.com/id/2155196039/photo/bongo-antelope.webp?a=1&b=1&s=612x612&w=0&k=20&c=sTGuGTaeWm2SmmsCsCkx-A5yKZpRNz98N59ZSTF0hGU="
    },
    {
      "id": "95",
      "likes": 1670,
      "name": "Gazelle",
      "scientific_name": "Antilopinae",
      "category": "mammal",
      "description": "Gazelles are graceful antelopes known for their speed and agility. They are adapted to living in open grasslands and savannas in Africa and Asia. Gazelles are social animals, often found in herds, and are known for their remarkable ability to evade predators through swift movements.",
      "habitat": "Grasslands and savannas in Africa and parts of the Middle East.",
      "diet": "Herbivore - primarily feeds on grasses and leaves.",
      "fun_facts": [
        "Gazelles can run at speeds up to 60 mph and can leap distances of up to 10 feet.",
        "They are known for their unique stotting behavior, where they jump high in the air to warn others of danger.",
        "Gazelles typically live in small groups, known as herds, that are generally matriarchal."
      ],
      "population": "Population varies by species; some are common while others are endangered.",
      "image_url": "https://media.istockphoto.com/id/616114736/photo/thomsons-gazelle-ngorongoro-tanzania-africa.webp?a=1&b=1&s=612x612&w=0&k=20&c=x7DAWdUCp_ayFt1gqLNmXUe9dKGmtRdVekDKsQu4AoU="
    },
    {
      "id": "96",
      "likes": 1470,
      "name": "Moose",
      "scientific_name": "Alces alces",
      "category": "mammal",
      "description": "Moose are the largest members of the deer family, characterized by their long legs, large bodies, and distinctive palmate antlers, which are found primarily in males. They are found in the northern regions of North America and Europe and are known for their strong swimming abilities.",
      "habitat": "Forests and wetlands in North America, Europe, and Asia.",
      "diet": "Herbivore - primarily feeds on leaves, shrubs, and aquatic plants.",
      "fun_facts": [
        "Moose can swim for over 6 miles and are known to submerge their bodies to graze on aquatic plants.",
        "Their antlers can weigh up to 100 pounds and are shed annually in the winter.",
        "Moose are solitary animals but can sometimes be seen in small groups during mating season."
      ],
      "population": "Estimated 1 million in the wild.",
      "image_url": "https://media.istockphoto.com/id/2162184533/photo/moose-on-the-loose.webp?a=1&b=1&s=612x612&w=0&k=20&c=FANw_HUkc4FnmT9fakpRsOlMi3Q_TdHIhbwWhDkT8Gk="
    },
    {
      "id": "97",
      "likes": 1770,
      "name": "Lynx",
      "scientific_name": "Lynx",
      "category": "mammal",
      "description": "Lynxes are medium-sized wild cats known for their tufted ears, short tails, and long legs. They are solitary and territorial hunters, primarily preying on small mammals and birds. Lynxes are adapted to snowy environments, with large furry paws that act as snowshoes.",
      "habitat": "Forests and tundra regions in North America, Europe, and Asia.",
      "diet": "Carnivore - primarily feeds on hares, rodents, and birds.",
      "fun_facts": [
        "Lynxes have excellent night vision, enabling them to hunt effectively in low-light conditions.",
        "They can leap up to 10 feet in a single jump.",
        "The Eurasian lynx is the largest species, which can weigh up to 40 pounds."
      ],
      "population": "Estimated 1 million for all lynx species; specific populations vary.",
      "image_url": "https://media.istockphoto.com/id/1475077987/photo/lynx-in-the-bayerischer-wald.webp?a=1&b=1&s=612x612&w=0&k=20&c=8FqL_iOkjLIAubRaF3h80CUfr9CjZhd_vTo8xsb221s="
    },
    {
      "id": "98",
      "likes": 1180,
      "name": "Jaguar",
      "scientific_name": "Panthera onca",
      "category": "mammal",
      "description": "Jaguars are the largest cats in the Americas, known for their powerful build and distinctive coat pattern marked with rosettes. They are solitary hunters and are primarily nocturnal, using their keen senses to find prey, which includes deer, capybaras, and caimans. Jaguars are also excellent swimmers and often hunt in water.",
      "habitat": "Tropical rainforests, swamps, and grasslands in Central and South America.",
      "diet": "Carnivore - primarily feeds on mammals, birds, and reptiles.",
      "fun_facts": [
        "Jaguars have the strongest bite force of all big cats, allowing them to crush the shells of turtles and the skulls of prey.",
        "They are known for their stealthy hunting techniques, often ambushing their prey.",
        "Jaguars are skilled swimmers and often hunt fish and other aquatic animals."
      ],
      "population": "Estimated 173,000 in the wild; populations are declining due to habitat loss.",
      "image_url": "https://media.istockphoto.com/id/546803214/photo/jaguar.webp?a=1&b=1&s=612x612&w=0&k=20&c=Phs3Vrk8mt1dWS6m7Y6KGaoPG_3jfN1nuVXE-VjRC4A="
    },
    {
      "id": "99",
      "likes": 1870,
      "name": "Panther",
      "scientific_name": "Puma concolor",
      "category": "mammal",
      "description": "Panthers, also known as cougars or mountain lions, are large, powerful felines that can be found throughout North America and South America. They are highly adaptable and can thrive in various habitats. Panthers are solitary and territorial hunters, primarily preying on deer and smaller animals.",
      "habitat": "Forests, mountains, and grasslands in North and South America.",
      "diet": "Carnivore - primarily feeds on deer, small mammals, and birds.",
      "fun_facts": [
        "Panthers can leap up to 40 feet in a single bound and can sprint at speeds of up to 50 mph.",
        "They are known for their distinctive vocalizations, including growls and purrs.",
        "Panthers are very adaptable and can thrive in diverse habitats, from deserts to forests."
      ],
      "population": "Estimated 50,000 in the wild.",
      "image_url": "https://media.istockphoto.com/id/1833290413/photo/the-cougar-puma-concolor-also-known-as-the-puma-mountain-lion-catamount-or-panther-is-a-large.webp?a=1&b=1&s=612x612&w=0&k=20&c=rMBFK6UPxZlbQjAu9lv2Y_oJTjQSwmmaLv1O8-h1ftQ="
    },
    {
      "id": "100",
      "likes": 1370,
      "name": "Squirrel",
      "scientific_name": "Sciuridae",
      "category": "mammal",
      "description": "Squirrels are small, nimble rodents found in a variety of habitats around the world, known for their bushy tails and sharp claws. They are excellent tree climbers and are primarily herbivorous, feeding on nuts, seeds, and fruits. Squirrels are highly social animals and often live in groups.",
      "habitat": "Forests, parks, and urban areas worldwide.",
      "diet": "Herbivore - primarily feeds on nuts, seeds, fruits, and vegetation.",
      "fun_facts": [
        "Squirrels can jump distances of up to 10 times their body length.",
        "They have sharp incisor teeth that continuously grow, requiring constant gnawing.",
        "Squirrels can bury thousands of nuts each season as a food reserve for winter."
      ],
      "population": "Estimated several million globally; some species are common in urban areas.",
      "image_url": "https://media.istockphoto.com/id/2150207031/photo/red-squirrel-scotland.webp?a=1&b=1&s=612x612&w=0&k=20&c=r6me5Nf9UWEOlsVGL3jDhaoE79gdTSPiV6WYMY7fUYg="
    },
    {
        "id": "101",
        "likes": 1315,
        "name": "Gharial",
        "scientific_name": "Gavialis gangeticus",
        "category": "reptile",
        "description": "The Gharial is a crocodilian known for its long, thin snout, which is adapted for catching fish. This species is primarily found in rivers in the Indian subcontinent.",
        "habitat": "Rivers and freshwater systems.",
        "diet": "Carnivore - feeds mainly on fish.",
        "fun_facts": [
            "Gharials can hold their breath underwater for up to two hours.",
            "They have specialized teeth that do not allow them to chew, so they swallow prey whole.",
            "This species is critically endangered, with fewer than 300 individuals remaining."
        ],
        "population": "Estimated at around 300 in the wild.",
        "image_url": "https://media.istockphoto.com/id/164425016/photo/gharial-crocodile-in-sand.webp?a=1&b=1&s=612x612&w=0&k=20&c=E8ftvqUxdpa3dfP1xZmaf0B0IIf5MT-tX0PNZhOYzBU="
    },
    {
        "id": "103",
        "likes": 1525,
        "name": "Tuatara",
        "scientific_name": "Sphenodon punctatus",
        "category": "reptile",
        "description": "The Tuatara is a unique reptile native to New Zealand, often referred to as a 'living fossil.' It is the only surviving member of its order, Rhynchocephalia, which thrived around 200 million years ago.",
        "habitat": "Forests and coastal areas.",
        "diet": "Carnivore - primarily feeds on insects, small birds, and their eggs.",
        "fun_facts": [
            "Tuatara have a third 'eye' on the top of their head that is sensitive to light.",
            "They can live for over 100 years.",
            "They take several years to reach sexual maturity."
        ],
        "population": "Currently around 60,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/487731192/photo/tuatara.jpg?s=612x612&w=0&k=20&c=ptM3-mhEnzMW5NhLqeQoobBKjcRfrpmD0Mz9dAukp_M="
    },
    {
        "id": "104",
        "likes": 1730,
        "name": "Pygmy Seahorse",
        "scientific_name": "Hippocampus bargibanti",
        "category": "fish",
        "description": "This tiny seahorse is found living among sea fans in coral reefs. It is hard to spot due to its small size and excellent camouflage.",
        "habitat": "Reef environments, especially around gorgonian corals.",
        "diet": "Carnivore - feeds on small crustaceans.",
        "fun_facts": [
            "Pygmy seahorses are less than 2.5 cm in size.",
            "They can change color to match their surroundings.",
            "They are monogamous and form lifelong bonds."
        ],
        "population": "Unknown, but not considered endangered.",
        "image_url": "https://media.istockphoto.com/id/1156323189/photo/master-of-camouflage-denises-pygmy-seahorse-hippocampus-denise-raja-ampat-indonesia.webp?a=1&b=1&s=612x612&w=0&k=20&c=dC3Svtu1p84yuLChhLzApcGNY4mSxgptKSsxMKvVKCU="
    },
    {
        "id": "105",
        "likes": 940,
        "name": "Aye-Aye",
        "scientific_name": "Daubentonia madagascariensis",
        "category": "mammal",
        "description": "The Aye-Aye is a type of lemur from Madagascar, known for its distinct long middle finger, which it uses to extract insects from tree bark.",
        "habitat": "Tropical forests.",
        "diet": "Omnivore - primarily feeds on wood-boring larvae and fruits.",
        "fun_facts": [
            "The Aye-Aye is both nocturnal and solitary.",
            "It has been misunderstood as an omen of death in local culture.",
            "Aye-Ayes can live up to 20 years in captivity."
        ],
        "population": "Estimated at around 10,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/690807138/photo/aye-aye-nocturnal-lemur-of-madagascar.webp?a=1&b=1&s=612x612&w=0&k=20&c=Blc5evKuQhAKO04S_HSVrXenqWNWQASc6_gg5mJbs7A="
    },
    {
        "id": "106",
        "likes": 650,
        "name": "Leafcutter Ant",
        "scientific_name": "Atta cephalotes",
        "category": "insect",
        "description": "Leafcutter ants are known for their unique behavior of cutting leaves and using them to cultivate fungus, which serves as their primary food source.",
        "habitat": "Tropical forests.",
        "diet": "Herbivore - primarily feeds on the fungus they cultivate.",
        "fun_facts": [
            "Leafcutter ants can carry objects up to 50 times their body weight.",
            "They live in large colonies that can number in the millions.",
            "The fungus they cultivate is specially adapted to grow on the leaves they cut."
        ],
        "population": "Unknown, found in many locations across Central and South America.",
        "image_url": "https://media.istockphoto.com/id/1491860074/photo/leaf-cutter-ant.webp?a=1&b=1&s=612x612&w=0&k=20&c=z70lxDYHQ-EP_Ok9caLOWa4l_yWwrsPnsMIVkU3pdxw="
    },
    {
        "id": "107",
        "likes": 760,
        "name": "Glass Frog",
        "scientific_name": "Centrolenidae",
        "category": "reptile",
        "description": "Glass frogs are known for their translucent skin that allows you to see their internal organs. They are primarily found in Central and South America.",
        "habitat": "Rainforests near streams.",
        "diet": "Carnivore - feeds on small insects.",
        "fun_facts": [
            "There are over 150 species of glass frogs.",
            "Their translucent skin provides excellent camouflage.",
            "Males call to attract females during the breeding season."
        ],
        "population": "Varies by species, some are endangered.",
        "image_url": "https://media.istockphoto.com/id/1364425539/photo/spiny-cochran-glass-frog.webp?a=1&b=1&s=612x612&w=0&k=20&c=Ds7624gYM7jCAVJkHC96CfHN5ZtR0gA4JYo4iwednSk="
    },
    {
        "id": "108",
        "likes": 1270,
        "name": "Blue Poison Dart Frog",
        "scientific_name": "Dendrobates tinctorius",
        "category": "amphibian",
        "description": "This small, brightly colored frog is native to the tropical forests of Madagascar, known for its potent poison.",
        "habitat": "Tropical rainforests.",
        "diet": "Carnivore - feeds on ants and termites.",
        "fun_facts": [
            "The bright coloration warns predators of its toxicity.",
            "Indigenous people have used their poison for hunting.",
            "In captivity, they lose their toxicity due to diet."
        ],
        "population": "Population levels decreasing due to habitat loss.",
        "image_url": "https://media.istockphoto.com/id/500344673/photo/azure-dart-frog-dendrobates-azureus.webp?a=1&b=1&s=612x612&w=0&k=20&c=Gh5RJohSwsgPMwnuEy1QyOnKI5JBs8U4ya9p2Wo_M8A="
    },
    {
        "id": "109",
        "likes": 1480,
        "name": "Mudskipper",
        "scientific_name": "Periophthalmus",
        "category": "fish",
        "description": "The Mudskipper is a unique fish that can move on land and use its pectoral fins to walk. They are typically found in intertidal zones.",
        "habitat": "Mudflats and mangroves.",
        "diet": "Carnivore - feeds on small invertebrates.",
        "fun_facts": [
            "Mudskippers can breathe through their skin and the lining of their mouth.",
            "They can survive several hours out of water.",
            "They use their fins to 'walk' across the land."
        ],
        "population": "Known to be common, but specific numbers are difficult to determine.",
        "image_url": "https://media.istockphoto.com/id/2163676101/photo/wild-mudskipper-in-bako-national-park-on-the-malaysian-side-of-borneo-asia.webp?a=1&b=1&s=612x612&w=0&k=20&c=cOpFhTySvYE4i1XOHsHDLb-v6B3KLl6WOUewxHORla0="
    },
    {
        "id": "110",
        "likes": 1490,
        "name": "Goliath Beetle",
        "scientific_name": "Goliathus goliatus",
        "category": "insect",
        "description": "One of the largest beetles in the world, the Goliath Beetle can grow up to 4 inches long and weighs as much as 3.5 ounces.",
        "habitat": "Tropical forests in Africa.",
        "diet": "Herbivore - primarily feeds on tree leaves.",
        "fun_facts": [
            "They can lift objects over 850 times their body weight.",
            "The larvae can take up to two years to mature.",
            "They undergo complete metamorphosis."
        ],
        "population": "Locally common but not assessed globally.",
        "image_url": "https://media.istockphoto.com/id/104278623/photo/goliath-beetle.webp?a=1&b=1&s=612x612&w=0&k=20&c=8NZ0YGehy67cV5W_sLaUQ8FzHdI_eh2Cud6xlv-oAp8="
    },
    {
        "id": "111",
        "likes": 1325,
        "name": "Spotted Hyena",
        "scientific_name": "Crocuta crocuta",
        "category": "mammal",
        "description": "The Spotted Hyena is a large carnivore known for its unique vocalizations, social structures, and hunting skills.",
        "habitat": "Savannas, grasslands, and woodlands.",
        "diet": "Carnivore - feeds on large mammals, scavenging and hunting.",
        "fun_facts": [
            "They have one of the loudest calls in the animal kingdom.",
            "Hyenas have a matriarchal society, where females dominate males.",
            "They can run for long distances at a speed of up to 65 km/h."
        ],
        "population": "Over 100,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/1297773195/photo/spotted-hyena.webp?a=1&b=1&s=612x612&w=0&k=20&c=1wqgxsDhbueNX7qiWqfMydkW2KaDiQMV40TvLMxJv_8="
    },
    {
        "id": "112",
        "likes": 1535,
        "name": "Marabou Stork",
        "scientific_name": "Leptoptilos crumeniferus",
        "category": "bird",
        "description": "The Marabou Stork is a large scavenging bird known for its large size and distinctive bald head.",
        "habitat": "Open savanna, wetlands, and near human habitation.",
        "diet": "Carnivore - primarily feeds on carrion.",
        "fun_facts": [
            "They can have a wingspan of up to 10 feet.",
            "Marabou storks are known for their bizarre courtship displays.",
            "Their bald heads help keep them clean when feeding on carcasses."
        ],
        "population": "Estimated around 300,000 in the wild.",
        "image_url": "https://plus.unsplash.com/premium_photo-1661959970378-db0e7c798506?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NXx8TWFyYWJvdSUyMFN0b3JrfGVufDB8fDR8fHww"
    },
    {
        "id": "113",
        "likes": 1840,
        "name": "Binturong",
        "scientific_name": "Arctictis binturong",
        "category": "mammal",
        "description": "The Binturong, also known as the bearcat, is a tree-dwelling mammal native to Southeast Asia, recognized for its unique scent similar to buttered popcorn.",
        "habitat": "Rainforests and tropical forests.",
        "diet": "Omnivore - eats fruits, leaves, and the occasional small animal.",
        "fun_facts": [
            "Binturongs have a prehensile tail that helps them navigate trees.",
            "They are not related to bears or cats despite their name.",
            "They have a strong musk smell that helps deter predators."
        ],
        "population": "Estimated 10,000 to 20,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/1095387808/photo/binturong.webp?a=1&b=1&s=612x612&w=0&k=20&c=xc8F4T1vEs55Yd1B9huOA0wg592geKxeVpSDJlCveuA="
    },
    {
        "id": "114",
        "likes": 1345,
        "name": "Spoonbill",
        "scientific_name": "Platalea",
        "category": "bird",
        "description": "Spoonbills are wading birds known for their distinctively shaped bills, which they use to forage in shallow waters.",
        "habitat": "Wetlands, marshes, and coastal regions.",
        "diet": "Carnivore - feeds on small fish and invertebrates.",
        "fun_facts": [
            "There are several species of spoonbills worldwide, including the Roseate Spoonbill.",
            "They can often be seen foraging in groups.",
            "Spoonbills are known for their elaborate courtship displays."
        ],
        "population": "Varies by species, with some endangered.",
        "image_url": "https://media.istockphoto.com/id/2169694445/photo/close-up-of-black-faced-spoonbill-with-breeding-plumage-standing-in-water-mai-po-natural.webp?a=1&b=1&s=612x612&w=0&k=20&c=tGgJWKTjOCjOr7XDVa9gA1P3aTIvu4o2Y5-Je3CDcAA="
    },
    {
        "id": "115",
        "likes": 1650,
        "name": "Takin",
        "scientific_name": "Budorcas taxicolor",
        "category": "mammal",
        "description": "The Takin is a large, muscular herbivore found in the eastern Himalayas and parts of China, known for its unique appearance and thick fur.",
        "habitat": "Mountainous regions, usually in dense vegetation.",
        "diet": "Herbivore - feeds on grasses, leaves, and bamboo.",
        "fun_facts": [
            "They are the national animal of Bhutan.",
            "Takin have a very active social structure, known to form herds.",
            "They can weigh over 600 pounds."
        ],
        "population": "Around 20,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/513360487/photo/golden-takin.webp?a=1&b=1&s=612x612&w=0&k=20&c=V3RKrlSIxmUGjVDj4CV0li0CdSOw_NyW61bIFus58nY="
    },
    {
        "id": "116",
        "likes": 1455,
        "name": "Cornsnake",
        "scientific_name": "Pantherophis guttatus",
        "category": "reptile",
        "description": "The Cornsnake is a non-venomous snake native to North America, commonly kept as a pet due to its docile nature.",
        "habitat": "Grasslands, forests, and farmland.",
        "diet": "Carnivore - primarily feeds on small rodents.",
        "fun_facts": [
            "Cornsnakes can grow up to 6 feet long.",
            "They are excellent climbers and swimmers.",
            "Their coloration provides effective camouflage in their natural habitat."
        ],
        "population": "Common in the wild; exact numbers unknown.",
        "image_url": "https://media.istockphoto.com/id/162579385/photo/corn-snake-on-a-branch.webp?a=1&b=1&s=612x612&w=0&k=20&c=uwddEbIesN7Kk-y12K8pEbwVZP6fkom2EKkcQPM2yUA="
    },
    {
        "id": "117",
        "likes": 1660,
        "name": "Fennec Fox",
        "scientific_name": "Vulpes zerda",
        "category": "mammal",
        "description": "The Fennec Fox is a small nocturnal fox with large ears, adapted for living in the sandy deserts of North Africa.",
        "habitat": "Sahara Desert and surrounding areas.",
        "diet": "Omnivore - feeds on insects, small mammals, and plants.",
        "fun_facts": [
            "Fennec foxes can tolerate temperatures up to 104F.",
            "Their large ears help dissipate heat and improve hearing.",
            "They are social animals living in family groups."
        ],
        "population": "Estimated 250,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/172132840/photo/desert-fox.webp?a=1&b=1&s=612x612&w=0&k=20&c=_ZzVV0R3KhkyCKKxN-OIFaZRYHfQJ62yNdJzmof3q1w="
    },
    {
        "id": "118",
        "likes": 1765,
        "name": "Saola",
        "scientific_name": "Pseudoryx nghetinhensis",
        "category": "mammal",
        "description": "The Saola, also known as the Asian unicorn, is an extremely rare mammal found in the Annamite Range of Vietnam and Laos.",
        "habitat": "Tropical forests.",
        "diet": "Herbivore - feeds on leaves and shrubs.",
        "fun_facts": [
            "First discovered in 1992, making it a relatively new species in the scientific community.",
            "Saolas have striking long horns and can grow to about 85 cm at the shoulder.",
            "They are elusive and rarely seen in the wild."
        ],
        "population": "Estimated fewer than 100 in the wild.",
        "image_url": "https://media.licdn.com/dms/image/v2/D4E12AQGniCbWy7Eo0w/article-cover_image-shrink_423_752/article-cover_image-shrink_423_752/0/1683659936527?e=1748476800&v=beta&t=H8psHeqlwy3mdSaBez__wrrFvfpweMjc6w0P4iNacXg"
    },
    {
        "id": "119",
        "likes": 1470,
        "name": "Musk Ox",
        "scientific_name": "Ovibos moschatus",
        "category": "mammal",
        "description": "The Musk Ox is a large, shaggy mammal native to the Arctic, known for its thick coat and strong odor during mating season.",
        "habitat": "Tundra and Arctic environments.",
        "diet": "Herbivore - primarily eats grasses, moss, and lichens.",
        "fun_facts": [
            "Musk oxen can weigh up to 900 pounds.",
            "They have a unique social structure, forming large herds.",
            "Their thick coat helps them survive extreme cold."
        ],
        "population": "About 80,000 in the wild.",
        "image_url": "https://cdn.britannica.com/66/138866-050-BA994892/Musk-ox.jpg?w=300"
    },
    {
        "id": "120",
        "likes": 1575,
        "name": "Firefly",
        "scientific_name": "Lampyridae",
        "category": "insect",
        "description": "Fireflies are bioluminescent insects known for their glowing abdomens, which they use for communication and mating.",
        "habitat": "Moist, humid environments, such as gardens, fields, and forests.",
        "diet": "Carnivore - larvae feed on small insects and snails; adults may not eat at all.",
        "fun_facts": [
            "Fireflies use their light to attract mates; different species have different patterns.",
            "They glow in response to chemicals in their bodies.",
            "Not all firefly species produce light."
        ],
        "population": "Common in many regions worldwide, but numbers are declining due to habitat loss.",
        "image_url": "https://media.istockphoto.com/id/2159646624/photo/glowing-firefly-at-night-on-stones.webp?a=1&b=1&s=612x612&w=0&k=20&c=GVQcSRXEc-g0UWrknONbpNQlSmse9sRbYhmHcSgD2h0="
    },
    {
        "id": "121",
        "likes": 2080,
        "name": "Eurasian Lynx",
        "scientific_name": "Lynx lynx",
        "category": "mammal",
        "description": "The Eurasian Lynx is a medium-sized wild cat known for its tufted ears and spotted fur, primarily found in Europe and Asia.",
        "habitat": "Forests, mountainous areas, and tundras.",
        "diet": "Carnivore - feeds on deer, rabbits, and birds.",
        "fun_facts": [
            "They can jump up to 3 meters in the air.",
            "Eurasian lynx are solitary animals.",
            "They have excellent hearing due to their large ears."
        ],
        "population": "Estimated around 50,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/1461758643/photo/young-eurasian-lynx.webp?a=1&b=1&s=612x612&w=0&k=20&c=q4cyRzJunEDLOfYzP3gExHzuhRZO7hF8o9Dn0HKXw7U="
    },
    {
        "id": "122",
        "likes": 2085,
        "name": "Arabian Oryx",
        "scientific_name": "Oryx leucoryx",
        "category": "mammal",
        "description": "The Arabian Oryx is a species of antelope that went extinct in the wild in the 1970s but has been successfully reintroduced.",
        "habitat": "Deserts and dry regions.",
        "diet": "Herbivore - primarily grazes on grasses and shrubs.",
        "fun_facts": [
            "Arabian oryxes can survive without water for long periods.",
            "They have long, straight horns, which can be up to 1 meter long.",
            "They were once hunted to near extinction for their beautiful horns."
        ],
        "population": "Around 1,000 in the wild, and more in reserves.",
        "image_url": "https://media.istockphoto.com/id/174605374/photo/white-oryx-in-dubai.webp?a=1&b=1&s=612x612&w=0&k=20&c=sIk8I6XV1fPh4ZgEEUc9XanO3VDAEn-R1yVpUWc3-9A="
    },
    {
        "id": "123",
        "likes": 1790,
        "name": "Okapi",
        "scientific_name": "Okapia johnstoni",
        "category": "mammal",
        "description": "The Okapi, often referred to as the zebra giraffe, is a unique herbivore from the rainforests of the Democratic Republic of Congo.",
        "habitat": "Tropical forests.",
        "diet": "Herbivore - feeds on leaves, fruits, and grasses.",
        "fun_facts": [
            "Despite its zebra-like stripes, the okapi is more closely related to the giraffe.",
            "They have a very keen sense of hearing.",
            "Okapis communicate through vocalizations and scent markings."
        ],
        "population": "Estimated 25,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/115862946/photo/okapi-okapia-johnstoni.webp?a=1&b=1&s=612x612&w=0&k=20&c=pYsDxfkEJ7RowmBXV7YLF92xtNEQdFngP_36JNffdvw="
    },
    {
        "id": "124",
        "likes": 1600,
        "name": "Emperor Moth",
        "scientific_name": "Saturnia pavonia",
        "category": "insect",
        "description": "The Emperor Moth is one of the largest species of moths in Europe, known for its striking appearances and colorful patterns.",
        "habitat": "Wooded areas and scrublands.",
        "diet": "Herbivore - larvae primarily feed on willow and other trees.",
        "fun_facts": [
            "Moths are often mistaken for butterflies, but they are nocturnal.",
            "Emperor moths have a wingspan of up to 6 inches.",
            "Adults do not eat; they solely rely on their fat reserves."
        ],
        "population": "Common throughout Europe, but specific numbers unknown.",
        "image_url": "https://media.istockphoto.com/id/522316762/photo/small-emperor-moth.webp?a=1&b=1&s=612x612&w=0&k=20&c=CWmQCg1ZND8rrwhMyP2rYU-PR-XXo8bW6vVDEFU8i78="
    },
    {
        "id": "125",
        "likes": 1105,
        "name": "African Grey Parrot",
        "scientific_name": "Psittacus erithacus",
        "category": "bird",
        "description": "The African Grey Parrot is a medium-sized parrot known for its high intelligence and ability to mimic human speech.",
        "habitat": "Rainforests and savannas.",
        "diet": "Herbivore - primarily feeds on seeds, nuts, and fruits.",
        "fun_facts": [
            "African Grey Parrots can live up to 60 years in captivity.",
            "They have an exceptional ability to solve problems and puzzles.",
            "Recognized for their advanced cognitive skills."
        ],
        "population": "Unknown, but habitat loss is a concern.",
        "image_url": "https://media.istockphoto.com/id/2135539336/photo/two-african-grey-parrots-perched-on-branch-scratching-each-other.webp?a=1&b=1&s=612x612&w=0&k=20&c=bADWNP1qGCcX_iS5a3euWuXqj_IuxXlAh4Z0v4fdJnw="
    },
    {
        "id": "126",
        "likes": 1110,
        "name": "Mandrill",
        "scientific_name": "Mandrillus sphinx",
        "category": "mammal",
        "description": "The Mandrill is a large primate found in the rainforests of Central Africa, known for its colorful face and rear.",
        "habitat": "Tropical rainforests.",
        "diet": "Omnivore - feeds on fruits, seeds, and small animals.",
        "fun_facts": [
            "Mandrills are the largest species of monkey.",
            "Their vivid colors serve as a signal to others in their species.",
            "They are mostly ground-dwelling but can climb trees."
        ],
        "population": "Estimated 1,500 in the wild.",
        "image_url": "https://media.istockphoto.com/id/943713082/photo/mandrill-at-the-zoo-in-duisburg.webp?a=1&b=1&s=612x612&w=0&k=20&c=i6fMI4QWzKcOgs6E8MarNbsxnwm8nwnpRvgHY1sY1tY="
    },
    {
        "id": "127",
        "likes": 1165,
        "name": "Indigo Bunting",
        "scientific_name": "Passerina cyanea",
        "category": "bird",
        "description": "The Indigo Bunting is a small migratory songbird known for its vibrant blue plumage in males.",
        "habitat": "Open woodlands and fields.",
        "diet": "Omnivore - feeds on seeds, berries, and insects.",
        "fun_facts": [
            "The male's bright blue feathers fade during the winter months.",
            "They are known for their beautiful singing, especially during mating season.",
            "Indigo Buntings are short-distance migrators."
        ],
        "population": "About 2 million in the wild.",
        "image_url": "https://media.istockphoto.com/id/1684716201/photo/indigo-bunting-with-sunflowers.webp?a=1&b=1&s=612x612&w=0&k=20&c=mLx5JbS-jFVreW3xEZ8Jw9VKkrip8wmZ5uoErtICiMg="
    },
    {
        "id": "128",
        "likes": 1525,
        "name": "Clouded Leopard",
        "scientific_name": "Neofelis nebulosa",
        "category": "mammal",
        "description": "The Clouded Leopard is a medium-sized wild cat native to the forests of Southeast Asia, noted for its cloud-like patterns on the fur.",
        "habitat": "Tropical and subtropical rainforests.",
        "diet": "Carnivore - feeds on birds, monkeys, and deer.",
        "fun_facts": [
            "Clouded leopards are excellent climbers and can descend trees headfirst.",
            "They have a unique hunting style, often ambushing prey from above.",
            "Their population is declining due to habitat loss and poaching."
        ],
        "population": "Estimated 10,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/172170247/photo/clouded-leopard.webp?a=1&b=1&s=612x612&w=0&k=20&c=OUExsctJrfnuE69q0NaZOJS-TWrNkQGYwyPguQr-wSo="
    },
    {
        "id": "129",
        "likes": 1370,
        "name": "Shooters Bee",
        "scientific_name": "Megachile rotundata",
        "category": "insect",
        "description": "The Shooters Bee is a solitary bee species known for pollinating alfalfa and other crops.",
        "habitat": "Grasslands and fields.",
        "diet": "Herbivore - feeds on nectar and pollen.",
        "fun_facts": [
            "They play a significant role in agricultural productivity.",
            "Shooters Bees are solitary and do not live in hives.",
            "They have a very short lifespan."
        ],
        "population": "Population numbers decrease due to habitat loss.",
        "image_url": "https://images.unsplash.com/photo-1502809842744-cad97ee732ac?w=600&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8M3x8c2hvb3RlcnMlMjBiZWV8ZW58MHx8NHx8fDA%3D"
    },
    {
        "id": "130",
        "likes": 1635,
        "name": "Cotton-top Tamarin",
        "scientific_name": "Saguinus oedipus",
        "category": "mammal",
        "description": "The Cotton-top Tamarin is a small monkey native to Colombia, known for its distinctive white crest of fur and sociable nature.",
        "habitat": "Tropical forests.",
        "diet": "Omnivore - feeds on fruits, insects, and small vertebrates.",
        "fun_facts": [
            "Cotton-top Tamarins are highly social and live in extended family groups.",
            "They are very vocal and communicate using various calls.",
            "This species is critically endangered due to habitat destruction."
        ],
        "population": "Fewer than 6,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/174860834/photo/cotton-top-tamarin.webp?a=1&b=1&s=612x612&w=0&k=20&c=Xb5YZbDzu89V3R2U_53DREAZkj9CZOAo1Uy5QHMVZuk="
    },
    {
        "id": "131",
        "likes": 1540,
        "name": "Shoebill",
        "scientific_name": "Balaeniceps rex",
        "category": "bird",
        "description": "The Shoebill is a large bird native to the swamps of central tropical Africa, known for its enormous shoe-shaped bill.",
        "habitat": "Wetlands and swamps.",
        "diet": "Carnivore - primarily feeds on fish and amphibians.",
        "fun_facts": [
            "Shoebills can grow over 4 feet tall.",
            "They have a unique hunting style, often standing still for long periods to ambush prey.",
            "Their population is declining due to habitat loss."
        ],
        "population": "Estimated under 10,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/1166067883/photo/wildlife-shot-of-a-rare-shoebill.webp?a=1&b=1&s=612x612&w=0&k=20&c=7smUQFAgfQkfaUqpSSsI7Iczzrq1UhWOsrkkptnIbS4="
    },
    {
        "id": "132",
        "likes": 1445,
        "name": "Numbat",
        "scientific_name": "Myrmecobius fasciatus",
        "category": "mammal",
        "description": "The Numbat is an insectivorous marsupial native to Australia, known for its long tongue and affinity for ants and termites.",
        "habitat": "Woodlands and forests.",
        "diet": "Carnivore - primarily feeds on termites.",
        "fun_facts": [
            "Numbats are diurnal and often found foraging during the day.",
            "They once roamed widely across Australia but now are confined to a few reserves.",
            "Numbats have a unique coloration with stripes across their back."
        ],
        "population": "Fewer than 1,000 individuals in the wild.",
        "image_url": "https://media.istockphoto.com/id/1340499129/photo/numbat.webp?a=1&b=1&s=612x612&w=0&k=20&c=jNw2jdY86mrB2JPO6VEvE4DFRn1T1ff3x_hwz-9hnjs="
    },
    {
        "id": "133",
        "likes": 1450,
        "name": "Zorilla",
        "scientific_name": "Ictonyx striatus",
        "category": "mammal",
        "description": "The Zorilla, also known as the striped polecat, is a small carnivorous mammal found in Africa, noted for its distinct stripes and strong odor.",
        "habitat": "Savannas and forests.",
        "diet": "Carnivore - feeds on insects, small mammals, and carrion.",
        "fun_facts": [
            "Zorillas can emit a foul-smelling spray to deter predators.",
            "They are skilled diggers and often create their burrows.",
            "Despite their appearance, Zorillas are not related to skunks."
        ],
        "population": "Common across their range, but exact numbers are unknown.",
        "image_url": "https://www.joelsartore.com/wp-content/uploads/stock/ANI107/ANI107-00291-1536x1023.jpg"
    },
    {
        "id": "134",
        "likes": 1670,
        "name": "Sulawesi Cuscus",
        "scientific_name": "Strigocuscus celebensis",
        "category": "mammal",
        "description": "The Sulawesi Cuscus is a tree-dwelling marsupial endemic to Sulawesi, Indonesia, recognized for its large eyes and thick fur.",
        "habitat": "Tropical rainforests.",
        "diet": "Herbivore - feeds mainly on leaves and fruits.",
        "fun_facts": [
            "They are primarily nocturnal, spending much of the day sleeping.",
            "Their prehensile tails help them navigate branches.",
            "Cuscuses can be quite vocal during the night."
        ],
        "population": "Locally common; population data is limited.",
        "image_url": "https://media.istockphoto.com/id/2181983647/photo/sulawesi-bear-cuscus-is-sitting-on-tree.webp?a=1&b=1&s=612x612&w=0&k=20&c=Vs-7jYuQel_epp6Tn2nEOd_kBjtzIV-CL6St-KzC6WI="
    },
    {
        "id": "135",
        "likes": 1670,
        "name": "Japanese Macaque",
        "scientific_name": "Macaca fuscata",
        "category": "mammal",
        "description": "The Japanese Macaque, also known as the snow monkey, is famous for its habit of bathing in hot springs during winter.",
        "habitat": "Temperate forests of Japan.",
        "diet": "Omnivore - feeds on fruits, nuts, seeds, and insects.",
        "fun_facts": [
            "They are the northernmost primates, surviving in snowy climates.",
            "Japanese Macaques are highly social and live in troops.",
            "Their unique behavior includes grooming and communicating with each other."
        ],
        "population": "Approximately 100,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/2167884272/photo/japanese-macaques-relaxing-in-hot-spring-during-winter.webp?a=1&b=1&s=612x612&w=0&k=20&c=mZchUtFjYWAp1HJ_E4pcxfdSpPfdSbRtAxwYvVI2N0g="
    },
    {
        "id": "136",
        "likes": 1575,
        "name": "Pangolin",
        "scientific_name": "Manis",
        "category": "mammal",
        "description": "Pangolins are scaly anteaters known for their unique armor of keratin scales, and they are critically endangered.",
        "habitat": "Forests and grasslands.",
        "diet": "Insectivore - primarily feeds on ants and termites.",
        "fun_facts": [
            "Pangolins roll into a ball for protection when threatened.",
            "They have long tongues to extract insects from their burrows.",
            "They are one of the most trafficked animals in the world."
        ],
        "population": "Global population numbers are unknown, but they are critically endangered.",
        "image_url": "https://media.istockphoto.com/id/1790695464/photo/portrait-of-an-indian-pangolin.webp?a=1&b=1&s=612x612&w=0&k=20&c=hu8QruBQhbv_RfUCsJwAaa3Likzn4Q0Jgl22nqks-n4="
    },
    {
        "id": "137",
        "likes": 1485,
        "name": "Thorny Devil",
        "scientific_name": "Moloch horridus",
        "category": "reptile",
        "description": "The Thorny Devil is a small lizard from Australia known for its thorny appearance and unique method of capturing water.",
        "habitat": "Deserts and arid areas.",
        "diet": "Carnivore - primarily feeds on ants.",
        "fun_facts": [
            "Thorny Devils can change color depending on the temperature.",
            "They collect rainwater and direct it to their mouths using grooves in their skin.",
            "They can puff up to look larger when threatened."
        ],
        "population": "Common in their habitat; exact numbers are unknown.",
        "image_url": "https://media.istockphoto.com/id/183306593/photo/thorny-devil.webp?a=1&b=1&s=612x612&w=0&k=20&c=0eGoel57XGzvCL6UIqEUCQ-WHes04VYcglQUTDXDcmw="
    },
    {
        "id": "139",
        "likes": 1490,
        "name": "Lemur Leaf Frog",
        "scientific_name": "Cruziohyla crayfordi",
        "category": "amphibian",
        "description": "The Lemur Leaf Frog is a brightly colored tree frog found in Central America, known for its striking green and yellow hues.",
        "habitat": "Rainforests near slow-moving streams.",
        "diet": "Carnivore - primarily feeds on insects.",
        "fun_facts": [
            "They change color when they are frightened or stressed.",
            "The eyes of this species are very prominent, contributing to its unique appearance.",
            "They are primarily nocturnal."
        ],
        "population": "Unknown, but they are experiencing habitat loss.",
        "image_url": "https://zoo.bca.ac.uk/wp-content/uploads/sites/2/2020/02/BCA-Small-Size-56-1024x684.jpg"
    },
    {
        "id": "139",
        "likes": 1555,
        "name": "African Wild Dog",
        "scientific_name": "Lycaon pictus",
        "category": "mammal",
        "description": "The African Wild Dog, also known as the painted wolf, is a highly social carnivore known for its unique fur patterns and cooperative hunting.",
        "habitat": "Savannas and open grasslands.",
        "diet": "Carnivore - primarily feeds on antelope and small mammals.",
        "fun_facts": [
            "They have a success rate of over 80% when hunting in packs.",
            "African wild dogs are known for their vocalizations and social bonds.",
            "They are one of the most endangered carnivores in the world."
        ],
        "population": "Estimated 6,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/1323457138/photo/african-wild-dog.webp?a=1&b=1&s=612x612&w=0&k=20&c=5CHWUdkpthrQKVOb_cPeoDRH2faogciIZk_UO2CLem0="
    },
    {
        "id": "140",
        "likes": 2040,
        "name": "Kea",
        "scientific_name": "Nestor notabilis",
        "category": "bird",
        "description": "The Kea is a large, intelligent parrot native to New Zealand, known for its curiosity and playful behavior.",
        "habitat": "Mountainous regions and forests.",
        "diet": "Omnivore - feeds on fruits, seeds, and even scavenges.",
        "fun_facts": [
            "Kea are known for their ability to solve puzzles and use tools.",
            "They have a strong playful nature and often destroy items out of curiosity.",
            "Kea can communicate using a range of calls and sounds."
        ],
        "population": "Estimated around 3,000 in the wild.",
        "image_url": "https://images.unsplash.com/photo-1482046187924-50f27dc64333?w=500&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8N3x8S2VhfGVufDB8fDR8fHww"
    },
    {
        "id": "141",
        "likes": 2305,
        "name": "Malayan Civet",
        "scientific_name": "Penelope albiventris",
        "category": "mammal",
        "description": "The Malayan Civet is a small, nocturnal mammal known for its long body and distinct markings.",
        "habitat": "Forests and rural areas.",
        "diet": "Omnivore - feeds on fruits, insects, and small animals.",
        "fun_facts": [
            "Malayan civets are important for seed dispersal.",
            "They have a strong sense of smell, aiding in foraging.",
            "Their fur patterns help them blend into their surroundings."
        ],
        "population": "Population is decreasing due to habitat loss.",
        "image_url": "https://upload.wikimedia.org/wikipedia/commons/5/56/Malay_civet.jpg"
    },
    {
        "id": "142",
        "likes": 2210,
        "name": "Dhole",
        "scientific_name": "Cuon alpinus",
        "category": "mammal",
        "description": "The Dhole, also known as the Asiatic wild dog, is a highly social carnivore found in Asia, known for its unique pack behavior.",
        "habitat": "Forests and grasslands.",
        "diet": "Carnivore - primarily hunts deer and wild boar.",
        "fun_facts": [
            "Dholes are known for their unique vocalizations and teamwork in hunts.",
            "They have a high success rate when hunting in packs.",
            "Dholes are endangered due to habitat loss and competition with other carnivores."
        ],
        "population": "Estimated 2,500-3,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/1424883149/photo/portrait-of-dhole.webp?a=1&b=1&s=612x612&w=0&k=20&c=SSDl7Rd-0foORFT29LcNy6OkpzYIu7E-CInxvAvYPSA="
    },
    {
        "id": "143",
        "likes": 2415,
        "name": "Red-crowned Crane",
        "scientific_name": "Grus japonensis",
        "category": "bird",
        "description": "The Red-crowned Crane is a large bird recognized for its striking white plumage and distinctive red crown.",
        "habitat": "Wetlands, marshes, and grasslands.",
        "diet": "Omnivore - feeds on plants, small fish, and insects.",
        "fun_facts": [
            "These cranes are known for their elaborate courtship dance.",
            "The Red-crowned Crane is considered a symbol of longevity in Japanese culture.",
            "They are socially monogamous and mate for life."
        ],
        "population": "Estimated at around 3,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/2148501463/photo/red-crowned-cranes-in-spring-in-eastern-hokkaido-parent-and-child-child-rearing-young-birds.webp?a=1&b=1&s=612x612&w=0&k=20&c=EaFZyf9TfgUDPDDlPgO4Xc4v_lzSYZauZ0NCwmyZmS0="
    },
    {
        "id": "144",
        "likes": 2220,
        "name": "Agama Lizard",
        "scientific_name": "Agama",
        "category": "reptile",
        "description": "Agama Lizards are a type of lizard often recognized for their vibrant colors and social behavior.",
        "habitat": "Savannahs and rocky areas.",
        "diet": "Omnivore - feeds on insects, fruits, and vegetables.",
        "fun_facts": [
            "Agama lizards can change color to regulate their temperature.",
            "They are commonly found basking on rocks and walls.",
            "Agama lizards can live for several years in the wild."
        ],
        "population": "Common in their natural habitats; specific numbers vary by species.",
        "image_url": "https://media.istockphoto.com/id/2177243487/photo/spider-man-agama.webp?a=1&b=1&s=612x612&w=0&k=20&c=wnQm6_WmAO2G6sxGXWMaexMlwBrRzk4E8rGe2YW4We8="
    },
    {
        "id": "145",
        "likes": 2225,
        "name": "Cuttlefish",
        "scientific_name": "Sepia",
        "category": "fish",
        "description": "Cuttlefish are cephalopods known for their amazing ability to change color and texture for communication and camouflage.",
        "habitat": "Shallow coastal waters, often in sandy or rocky regions.",
        "diet": "Carnivore - primarily feeds on crustaceans and fish.",
        "fun_facts": [
            "Cuttlefish have a brain-to-body ratio comparable to that of mammals.",
            "They can display a wide range of colors to communicate.",
            "Cuttlefish have three hearts and blue blood."
        ],
        "population": "Common in many coastal areas; specific numbers not tracked.",
        "image_url": "https://media.istockphoto.com/id/2170645354/photo/cuttlefish.webp?a=1&b=1&s=612x612&w=0&k=20&c=jZmNE_-X_AmmJttVgMEFQHGBWReXGGxmFUNnN1ucxs4="
    },
    {
        "id": "146",
        "likes": 1230,
        "name": "Emperor Scorpion",
        "scientific_name": "Pandinus imperator",
        "category": "insect",
        "description": "The Emperor Scorpion is one of the largest scorpions in the world, known for its striking size and intimidating appearance.",
        "habitat": "Savannas, rainforests, and deserts in Africa.",
        "diet": "Carnivore - feeds on insects and small arthropods.",
        "fun_facts": [
            "They glow under ultraviolet light due to substances in their exoskeletons.",
            "Emperor scorpions can live for over 8 years in captivity.",
            "They are relatively docile and are often kept as pets."
        ],
        "population": "Common in their range, population numbers vary.",
        "image_url": "https://media.istockphoto.com/id/2161351263/photo/emperor-scorpion.webp?a=1&b=1&s=612x612&w=0&k=20&c=jLUJBCxxiVurqzTKOObumwoG-OD2bBwBOiLa8r-OQQI="
    },
    {
        "id": "147",
        "likes": 2235,
        "name": "Giant Anteater",
        "scientific_name": "Myrmecophaga tridactyla",
        "category": "mammal",
        "description": "The Giant Anteater is a large mammal known for its elongated snout and tongue, used to feed predominantly on ants and termites.",
        "habitat": "Grasslands, savannas, and forests.",
        "diet": "Insectivore - feeds primarily on ants and termites.",
        "fun_facts": [
            "Giant anteaters can consume up to 30,000 insects in a single day.",
            "They use their strong claws for digging into ant mounds.",
            "Giant anteaters are solitary animals."
        ],
        "population": "About 5,000 in the wild.",
        "image_url": "https://media.istockphoto.com/id/2162029236/photo/flag-anteater.webp?a=1&b=1&s=612x612&w=0&k=20&c=k4csW_OPajfpoHyvRjm1blInsw4feicLduI283YyXvE="
    },
    {
        "id": "148",
        "likes": 2240,
        "name": "Asian Arowana",
        "scientific_name": "Scleropages formosus",
        "category": "fish",
        "description": "The Asian Arowana, also known as the Dragon Fish, is considered one of the most auspicious fish in Asia due to its association with good luck.",
        "habitat": "Freshwater rivers and swamps.",
        "diet": "Carnivore - feeds on insects and smaller fish.",
        "fun_facts": [
            "They can leap out of the water to catch prey.",
            "Asian arowanas can grow up to 3 feet in length.",
            "They are popular in aquaculture and may sell for thousands of dollars."
        ],
        "population": "Critically endangered due to overfishing and habitat destruction.",
        "image_url": "https://media.istockphoto.com/id/485352678/photo/arowana-fish.webp?a=1&b=1&s=612x612&w=0&k=20&c=0n9EWWIvu_IxoOgkdQ5A3rf4a9IDf7t9MiaSCDDfQhQ="
    },
    {
        "id": "149",
        "likes": 1245,
        "name": "North American Porcupine",
        "scientific_name": "Erethizon dorsatum",
        "category": "mammal",
        "description": "The North American Porcupine is known for its defensive quills, which it uses when threatened.",
        "habitat": "Forests and woodlands.",
        "diet": "Herbivore - primarily feeds on leaves, bark, and fruits.",
        "fun_facts": [
            "Porcupines can release quills when threatened, and these can detach easily.",
            "They have a strong sense of smell.",
            "Porcupines are primarily nocturnal."
        ],
        "population": "Common across North America; specific numbers are difficult to estimate.",
        "image_url": "https://media.istockphoto.com/id/2186208557/photo/north-american-porcupine-in-grass-on-a-late-fall-afternoon.webp?a=1&b=1&s=612x612&w=0&k=20&c=uEb7SPwKTzDkiv6XMcIQjE0Zg2w8056VX8QFyvlTjmU="
    },
    {
        "id": "150",
        "likes": 1255,
        "name": "Violet Green Swallow",
        "scientific_name": "Tachycineta thalassina",
        "category": "bird",
        "description": "The Violet Green Swallow is a small bird known for its agility and vivid green and violet colors.",
        "habitat": "Open and semi-open areas, often near water.",
        "diet": "Insectivore - feeds on insects caught in flight.",
        "fun_facts": [
            "Violet Green Swallows are known for their aerial acrobatics.",
            "They build their nests in tree cavities."
        ],
        "population": "Estimated 1 million in the wild.",
        "image_url": "https://bloximages.newyork1.vip.townnews.com/yakimaherald.com/content/tncms/assets/v3/editorial/3/49/349ae755-a6fc-5118-bcaf-683af96ac609/5e8501c3255cf.image.jpg?resize=990%2C811"
    },
  {
      "id": "151",
      "likes": 2260,
      "name": "Atlas Moth",
      "scientific_name": "Attacus atlas",
      "category": "insect",
      "description": "The Atlas Moth is one of the largest moth species in the world, known for its enormous wingspan and striking appearance.",
      "habitat": "Tropical and subtropical forests in Southeast Asia.",
      "diet": "Herbivore - primarily feeds on the leaves of tropical trees.",
      "fun_facts": [
          "Its wingspan can reach up to 10 inches.",
          "Adult Atlas Moths do not eat; they rely on energy stored during the larval stage.",
          "They are one of the largest moths and can be found in a variety of colors."
      ],
      "population": "Common in their range; specific numbers are unknown.",
      "image_url": "https://media.istockphoto.com/id/2152261803/photo/newly-hatched-atlas-moth-in-butterfly-atrium.webp?a=1&b=1&s=612x612&w=0&k=20&c=mz-C6u9fYPZZ4r8CmOgqFLn_UUgUOoZRndG5HyWf3pM="
  },
  {
      "id": "152",
      "likes": 2615,
      "name": "Bombardier Beetle",
      "scientific_name": "Brachinus spp.",
      "category": "insect",
      "description": "The Bombardier Beetle is known for its unique defensive mechanism that allows it to expel a hot chemical spray.",
      "habitat": "Various habitats including forests, grasslands, and gardens.",
      "diet": "Carnivore - feeds on other insects.",
      "fun_facts": [
          "They can spray a boiling chemical cocktail at predators.",
          "Bombardier Beetles can aim their spray in different directions.",
          "Their spray can reach temperatures of up to 100C."
      ],
      "population": "Common in many areas; specific numbers vary.",
      "image_url": "https://media.istockphoto.com/id/2157058893/photo/bombardier-beetle-sitting-on-a-plant-leaf.webp?a=1&b=1&s=612x612&w=0&k=20&c=VzY7yAX_lYiXOUSETrNxnHItp8eSBUyg3ANq1OfN9sc="
  },
  {
      "id": "153",
      "likes": 1270,
      "name": "Golden Tortoise Beetle",
      "scientific_name": "Charidotella sexpunctata",
      "category": "insect",
      "description": "The Golden Tortoise Beetle is known for its striking metallic gold color and ability to change color when disturbed.",
      "habitat": "Leafy plants in gardens and fields in the Americas.",
      "diet": "Herbivore - primarily feeds on morning glory leaves.",
      "fun_facts": [
          "When threatened, they can excrete a fluid that turns their golden color to a darker hue.",
          "They are often called 'golden tortoise' due to their shell-like appearance.",
          "Their color change is a form of camouflage."
      ],
      "population": "Common; not threatened.",
      "image_url": "https://media.istockphoto.com/id/2152417444/photo/charidotella-sexpunctata.webp?a=1&b=1&s=612x612&w=0&k=20&c=_c7OOxkZLK3fs0Hw0S3bbZdozOb4AbZ31SN7X2jrbIY="
  },
  {
      "id": "154",
      "likes": 1275,
      "name": "Glasswing Butterfly",
      "scientific_name": "Greta oto",
      "category": "insect",
      "description": "The Glasswing Butterfly is known for its transparent wings and delicate appearance.",
      "habitat": "Tropical forests in Central and South America.",
      "diet": "Herbivore - feeds on nectar from flowers.",
      "fun_facts": [
          "The transparent wings make them difficult to spot among foliage.",
          "They are known for their slow, graceful flight.",
          "Glasswings have a unique way of feeding by siphoning nectar."
      ],
      "population": "Common in their habitats; specific numbers are not tracked.",
      "image_url": "https://media.istockphoto.com/id/108354703/photo/glasswing-butterfly-greta-oto.webp?a=1&b=1&s=612x612&w=0&k=20&c=zAz35ZBYfRN5MVgf4zdmMlTin3OsF5igKgN29etZq-g="
  },
  {
      "id": "155",
      "likes": 2185,
      "name": "Lanternfish",
      "scientific_name": "Myctophidae",
      "category": "fish",
      "description": "Lanternfish are small deep-sea fish known for their bioluminescence, which they use for communication and camouflage.",
      "habitat": "Deep ocean waters, often at considerable depths.",
      "diet": "Carnivore - feeds on zooplankton and other small marine organisms.",
      "fun_facts": [
          "They possess photophores, specialized cells that produce light.",
          "Lanternfish are a crucial part of the marine food web.",
          "Some species can migrate vertically to the surface at night."
      ],
      "population": "Common in deep oceans; specific numbers unknown.",
      "image_url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTQ3Dy9BlxURkMMtlUEbHJ196Xm_r9zCuDU2w&s"
  },
  {
      "id": "156",
      "likes": 2190,
      "name": "Goblin Shark",
      "scientific_name": "Mitsukurina owstoni",
      "category": "fish",
      "description": "The Goblin Shark is a rare deep-sea shark known for its distinctive protruding jaw and pinkish hue.",
      "habitat": "Deep ocean waters around the world.",
      "diet": "Carnivore - feeds on fish and squid.",
      "fun_facts": [
          "They are often referred to as 'living fossils' due to their ancient lineage.",
          "Goblin sharks can extend their jaws to catch prey.",
          "They are rarely seen by humans, as they inhabit deep waters."
      ],
      "population": "Not fully known; uncommon in many areas.",
      "image_url": "https://media.istockphoto.com/id/1213433623/photo/goblin-shark.webp?a=1&b=1&s=612x612&w=0&k=20&c=JvdL_8a2636qtNPjn2bGp94rjId__rJNYIwjFvbRdPQ="
  },
  {
      "id": "157",
      "likes": 2915,
      "name": "African Cichlid",
      "scientific_name": "Cichlidae",
      "category": "fish",
      "description": "African Cichlids are a diverse group of freshwater fish known for their bright colors and interesting behaviors.",
      "habitat": "Freshwater lakes and rivers in Africa.",
      "diet": "Omnivore - feeds on algae, small invertebrates, and detritus.",
      "fun_facts": [
          "They display remarkable color variation, especially during breeding.",
          "Many species have unique parenting behaviors where males attract females with a vibrant display.",
          "African Cichlids are popular in the aquarium trade."
      ],
      "population": "Common; numerous species exist.",
      "image_url": "https://media.istockphoto.com/id/517123210/photo/image-of-school-of-malawi-cichlids-in-tropical-aquarium-fish-tank.webp?a=1&b=1&s=612x612&w=0&k=20&c=PlcZXkxXJ51yCvMFsZjhQhiQGwgbtOwue2ZRMabKTQs="
  },
  {
      "id": "158",
      "likes": 1300,
      "name": "Cleaner Wrasse",
      "scientific_name": "Labroides dimidiatus",
      "category": "fish",
      "description": "The Cleaner Wrasse is a small, brightly colored fish known for its role in cleaning parasites from larger fish.",
      "habitat": "Coral reefs in the Indo-Pacific region.",
      "diet": "Carnivore - feeds on parasites and dead tissue of larger fish.",
      "fun_facts": [
          "Cleaner wrasses engage in mutualistic relationships, benefiting both themselves and their clients.",
          "They set up 'cleaning stations' where fish come to be cleaned.",
          "Their presence is essential for maintaining the health of reef ecosystems."
      ],
      "population": "Common on coral reefs; specific numbers are uncertain.",
      "image_url": "https://media.istockphoto.com/id/119752886/photo/labroides-dimidiatus.webp?a=1&b=1&s=612x612&w=0&k=20&c=gDxLokZDHxymxrUvGtrXtvdtjkFLsw3b4AhLX-OUUHU="
  },
  {
      "id": "159",
      "likes": 1305,
      "name": "Clown Triggerfish",
      "scientific_name": "Balistoides conspicillum",
      "category": "fish",
      "description": "The Clown Triggerfish is a brightly colored fish known for its bold patterns and behavior.",
      "habitat": "Coral reefs in the Pacific Ocean.",
      "diet": "Carnivore - feeds on crustaceans, mollusks, and small fish.",
      "fun_facts": [
          "Clown Triggerfish are known for their striking coloration and patterns.",
          "They possess powerful jaws that help them crack open shells.",
          "They can be aggressive when defending their territory."
      ],
      "population": "Common in coral reefs; not currently threatened.",
      "image_url": "https://media.istockphoto.com/id/1657007917/photo/clown-triggerfish-swimming-in-aquarium-clownfish-or-balistoides-conspicillum-tropical-fish.webp?a=1&b=1&s=612x612&w=0&k=20&c=GiKTgS_HrsKrtFk3KC4PAq2etqcWN9R8ZyEX3HN8tXc="
  },
  {
      "id": "160",
      "likes": 1310,
      "name": "Mandarin Dragonet",
      "scientific_name": "Synchiropus splendidus",
      "category": "fish",
      "description": "The Mandarin Dragonet is a small, vibrantly colored fish known for its incredible patterns and beautiful appearance.",
      "habitat": "Coral reefs in the Pacific Ocean.",
      "diet": "Carnivore - primarily feeds on small crustaceans and zooplankton.",
      "fun_facts": [
          "Mandarin Dragonets are often considered one of the most beautiful reef fish.",
          "They have a unique mode of swimming that involves fluttering their fins.",
          "These fish are known for their delicate nature and require a well-maintained environment."
      ],
      "population": "Common in their range; not currently threatened.",
      "image_url": "https://media.istockphoto.com/id/1793485006/photo/synchiropus-splendidus-the-mandarinfish-or-mandarin-dragonet-is-a-small-brightly-colored.webp?a=1&b=1&s=612x612&w=0&k=20&c=mDRgrotw8vSXzTf2M4z4UV41JHDSaYW51P7BNkBHm24="
  },
  {
      "id": "161",
      "likes": 2315,
      "name": "Ghost Pipefish",
      "scientific_name": "Solenostomus spp.",
      "category": "fish",
      "description": "Ghost Pipefish are slender fish known for their ability to blend in with seaweed and corals.",
      "habitat": "Coral reefs and seagrass beds in tropical waters.",
      "diet": "Carnivore - primarily feeds on small crustaceans.",
      "fun_facts": [
          "Ghost Pipefish are closely related to seahorses and have similar reproductive behaviors.",
          "Their camouflage helps them evade predators.",
          "They come in various shapes and colors, enhancing their disguise."
      ],
      "population": "Not well studied; may vary by species.",
      "image_url": "https://media.istockphoto.com/id/183778501/photo/ghost-pipefish-in-red-sea-whips.webp?a=1&b=1&s=612x612&w=0&k=20&c=5F5MHofnRVZ2WTMvwfZykMzZtnNRSWIMcFIxIhW1AIM="
  },
  {
      "id": "162",
      "likes": 2320,
      "name": "Surgeonfish",
      "scientific_name": "Acanthuridae",
      "category": "fish",
      "description": "Surgeonfish are brightly colored reef fish known for their sharp spines on either side of their tails.",
      "habitat": "Coral reefs in warm waters.",
      "diet": "Herbivore - feeds on algae and seaweed.",
      "fun_facts": [
          "The sharp spines of Surgeonfish can be used in defense against predators.",
          "They are often seen grazing on algae-covered rocks.",
          "Some surgeonfish can change their color during aggressive interactions."
      ],
      "population": "Common; specific numbers depend on species.",
      "image_url": "https://media.istockphoto.com/id/2164759471/photo/school-of-powderblue-surgeonfish-wide-angle.webp?a=1&b=1&s=612x612&w=0&k=20&c=vlcIX6rZ5TROqiGg_ftk8-yEx0UTuhx_FUojKx-eKgk="
  },
  {
      "id": "163",
      "likes": 2330,
      "name": "Northern Alligator Lizard",
      "scientific_name": "Elgaria coerulea",
      "category": "reptile",
      "description": "The Northern Alligator Lizard is a medium-sized lizard recognized for its robust body and distinctive patterns.",
      "habitat": "Forest edges, grasslands, and shrub areas.",
      "diet": "Carnivore - feeds on insects and small animals.",
      "fun_facts": [
          "They are known for their ability to regenerate lost tails.",
          "Northern Alligator Lizards are often found under rocks or logs.",
          "They have a wide distribution across the western United States."
      ],
      "population": "Common in their native range.",
      "image_url": "https://myodfw.com/sites/default/files/styles/600x360/public/2018-11/northern_alligator_lizard_simon_wray_odfw_0.webp?itok=Uj2QbBKa"
  },
  {
      "id": "164",
      "likes": 2335,
      "name": "Horned Lizard",
      "scientific_name": "Phrynosoma",
      "category": "reptile",
      "description": "Horned Lizards, also known as horn toads, are recognized for their unique body shape and spiny appearance.",
      "habitat": "Arid and semi-arid regions, such as deserts and scrublands.",
      "diet": "Insectivore - primarily feeds on ants and other small insects.",
      "fun_facts": [
          "They can flatten their bodies when threatened to evade predators.",
          "Horned Lizards have the ability to shoot blood from their eyes as a defense mechanism.",
          "They are able to camouflage effectively among rocks and sand."
      ],
      "population": "Common in their habitats, but some species are threatened.",
      "image_url": "https://media.istockphoto.com/id/1340652120/photo/coast-horned-lizard-is-a-species-of-phrynosomatid-lizard-which-can-be-found-in-baja.webp?a=1&b=1&s=612x612&w=0&k=20&c=QG4oWed9pTv-SociBjsK7E9tRlXkaZ7wdJdMbrcuKS4="
  },
  {
      "id": "165",
      "likes": 1340,
      "name": "Invisible Ladybug",
      "scientific_name": "Clytra laeviuscula",
      "category": "insect",
      "description": "The Invisible Ladybug is a type of beetle known for its unique color-changing ability, allowing it to blend into its surroundings.",
      "habitat": "Forests and gardens.",
      "diet": "Herbivore - feeds on aphids and other pests.",
      "fun_facts": [
          "When threatened, they can change color to match their environment.",
          "They are beneficial for pest control in gardens.",
          "Some species can emit a foul smell to deter predators."
      ],
      "population": "Common; specific numbers are not well documented.",
      "image_url": "https://images.unsplash.com/photo-1470317596697-cbdeda56f999?w=600&auto=format&fit=crop&q=60&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MTV8fEludmlzaWJsZSUyMExhZHlidWd8ZW58MHx8NHx8fDA%3D"
  },
  {
      "id": "166",
      "likes": 1345,
      "name": "Redback Spider",
      "scientific_name": "Latrodectus hasselti",
      "category": "insect",
      "description": "The Redback Spider is a highly venomous spider known for its distinctive red hourglass marking on its abdomen.",
      "habitat": "Urban areas, gardens, and under rocks.",
      "diet": "Carnivore - feeds on insects and small invertebrates.",
      "fun_facts": [
          "They are closely related to the black widow spider.",
          "Redback Spiders can produce silk for webs that can stretch several meters.",
          "The venom of the female is highly neurotoxic."
      ],
      "population": "Common in Australia and nearby regions.",
      "image_url": "https://media.istockphoto.com/id/2193238637/photo/australian-redback-spider.webp?a=1&b=1&s=612x612&w=0&k=20&c=dGJ_3T9Hz-z2ktbKCj0abAsvGWV1aSqmEvyQlpZM3mg="
  },
  {
      "id": "167",
      "likes": 1350,
      "name": "Atlas Beetle",
      "scientific_name": "Chalcosoma atlas",
      "category": "insect",
      "description": "The Atlas Beetle is one of the largest beetles in the world, featuring a striking horned appearance.",
      "habitat": "Tropical forests in Southeast Asia.",
      "diet": "Herbivore - primarily feeds on decaying wood.",
      "fun_facts": [
          "Males have large horns that they use in fights for mates.",
          "Atlas Beetles can grow up to 4-6 inches in length.",
          "They are often collected for display due to their impressive size."
      ],
      "population": "Common in tropical areas.",
      "image_url": "https://media.istockphoto.com/id/1069985516/photo/wild-atlas-beetles.webp?a=1&b=1&s=612x612&w=0&k=20&c=kJ-nVK1VW3WEmmb1TWvPA12mXbXXyILjVBQkaSb7Xrs="
  }
  ]
}